{"pages":[],"posts":[{"title":"123","text":"原文很多时候，犹豫会消磨掉我们的意志和想法。记得许多年前又一次逛估衣街，我对于各种商家出售的货品并没有多大兴趣，反而在看到那些古旧的木质匾额和明显滞后于这个时代风格的建筑时，我被深深地吸引住了。仿佛从一个片段就能会放出当年繁华的街市一般，一种探索的感觉隐隐升起。那时，我还小。 在前几天，偶然见到一些藏在闹市之间的格格不入的院落，我觉得是时候要做一些事情，去勾画我的想象了。记录的目的地选定在重庆道，作为五大道之一，自然有不少名人故居、历史建筑什么的坐落于此，不过这些都不在我的记录范围。我要探寻的是那些第一眼就能触动我的，而标准我一时还想不好，反正像“某王府”那种人工修饰痕迹很重的地方，我是没多大兴趣的，反而是与时代或说与光鲜的表面反差很大的才是我关注的。至于水平高低，只能说新手上路、初学乍练。一没经验、二没装备，只能慢慢摸索，希望以后我会做得更好。 再读旧文 以上内容为旧文搬运日期：2022年2月20日 时隔多年，文中提到的那些事依然没有去做，但依然有想法。已经忘了当初的起因，只记得后来每次看到伴随着自己成长的建筑拆除的时候，那种记录就是保存的想法就每一次出现。小时候住过的房子、瞎跑的胡同、步行几分钟就能到的小学、没有汽车的僻静马路、放学时骑车穿行的小区、大学的南大门，等等等等都慢慢不见了，只剩下脑子里的画面，却也只能日渐模糊。图像的文字的记录可能是一个普通人能够去保留和回忆那些过往最有效的方法了，每一次迟疑每一次明天都可能再一次丢掉一个现实存在的场景。标题没有改，就是当时随手敲下的“123”，寓意着简单和开始，恰好符合文字想要表达的。重启小站、重启当年的那些个想法，希望这一次会更好。","link":"/2012/12/123/"},{"title":"Markdown 参考文档","text":"最大标题第二大标题最小标题这是粗体文本这是斜体文本这是错误文本此文本 非常 重要所有这些文本都很重要Text that is not a quote Text that is a quote 使用 git status 列出尚未提交的所有新文件或已修改文件。一些基本的 Git 命令为： 123git statusgit addgit commit 本站点是使用 GitHub Pages 构建的。 George Washington John Adams Thomas Jefferson James Madison James Monroe John Quincy Adams 第一个列表项 第一个嵌套列表项 第二个嵌套列表项 #739 https://github.com/octo-org/octo-repo/issues/740 Add delight to the experience when all tasks are complete :tada: First Header Second Header Content Cell Content Cell Content Cell Content Cell Command Description git status List all new or modified files git diff Show file differences that haven’t been staged Left-aligned Center-aligned Right-aligned git status git status git status git diff git diff git diff Here is a simple flow chart: 12345graph TD; A--&gt;B; A--&gt;C; B--&gt;D; C--&gt;D;","link":"/2022/02/Markdown%20%E5%8F%82%E8%80%83%E6%96%87%E6%A1%A3/"},{"title":"Hello Cath","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/02/hello-world/"},{"title":"不要劝人向恶","text":"原文在看过死亡实验之后，一种很压抑的感觉持续了几十分钟。不同于夜晚回想恐怖片情节，也不同于影院大屏幕影音的震撼，而是一种完全的心理上的影响。在现在这样的花花世界里，一部影片在播放完究竟保有多久的记忆呢，在我不算多的观影记忆中，关掉播放器的那一刻差不多也就告别了影片相关的一切，即便是优秀的片子也只是作为茶余谈资而已，而这一会迟迟走不出电影情节的感觉还是头一次。 在豆瓣上，我给死亡实验打了5星得评价，其实从很多方面来说这个片子都有一些缺憾，比如没有很好的开始、结局的处理也比较仓促、也没有在情感上做过分的渲染，不过这些技术因素在一个绝好的选材面前都不再重要。在当惯了中立观影人时，突然遇到一部直至内心的影片，强烈的共鸣感打动了我。看了看豆瓣上的影评，知道影片以一个真实的“监狱实验”为背景，情节也基本一致，虽然伤亡情况更为突出，不过考虑到影片中实验者为成年人不同于真是实验的大学生，情节并不突兀。影片更多的作为一种记述，实验本身所要研究的简单来说就是环境对人性格的影响，进而有人延伸到当权利不受限制时出现的情况。我想说的是，人性本如何，本恶。 再读旧文 以上内容为旧文搬运日期：2022年2月20日","link":"/2012/12/%E4%B8%8D%E8%A6%81%E5%8A%9D%E4%BA%BA%E5%90%91%E6%81%B6/"},{"title":"免费建立一个自己的小站有多难","text":"原文当我费了九牛二虎之力终于能开始写下现在的文字时，我觉得要实现这个目标真的没有随口说说的那么简单。对于一个突发奇想要自助建站而又没有任何经验的人来说，面对的问题是根本不知道从何下手，简单描述下我的建站经历吧。 首先要确定目的。如果你只是想写写博客，那没必要走下面的好多条弯路。可以直接使用现成的免费博客，像大众化的新浪博客、偏技术类的cnblogs、甚至QQ空间也都是不错的选择。其实这也是我最初的想法，找个空间记录一些东西，不过事实证明我对于写东西的兴趣远没有我想的那么强烈。很快我就走偏了，找到一个自己能控制的空间成为了当前目标。我走的第一个弯路是新浪的SAE， 在我注册时SAE还不像现在有那么多限制和收费，品牌效应和提供的服务让我感觉终于找到组织了。也是在这里，我才第一次安装了typecho，很奇怪为什么不是wordpress。能在可控的空间自由的选择程序安装对于从类似QQ空间走过来的我，当时真的非常兴奋，暗下决心从此开始玩博客了的念头也是有过的。当然在激动之余，考虑了下云豆的费用，觉得为了三天打鱼两天晒网的花钱实在不值，于是果断放弃，进而开始下面更为艰难的寻找过程。 为什么会艰难，即使是找个免费空间也是百度一搜一大片，所以我也很纳闷我是不是走错了路。我的目标是免费的域名和空间，不要求顶级域名，只要能访问、速度上说的过去就行。第一个选定的是Free Web Hosting Area，这算是一个相当不错的免费空间供应商了，也提供比较好的域名后缀，我当然不喜欢那种数字字母组合的密码式后缀，唯一的限制是30天至少一次的点击，可以说很适合个人建站。本来用得好好的，我也在上面试验了wp、joomla，不过后来ftp就变得非常不好用了，几乎是不停的掉线，到后来干脆连个人域名都访问不了。难道被墙了？不可能啊，我什么还都没写呢，不过发现还是可以通过代理访问的，估计是eighting big期间又墙了一批地址，我的小站也不幸中枪了，只好放弃。 偶然的机会看到一篇文章WordPress建站指南，按图索骥找到kilu.de。又发现一个相当不错的空间，只是在注册上遇到一点困难，网站限制了中国ip，通过代理搞定。注册域名、安装wp都很顺利，导致我再次更换的原因出现在一个wp插件的安装上。Google Analyticator提示“Google PHP API Client requires the CURL PHP extension”，这种问题我显然搞不定，上论坛一看管理员对于类似问题的回复就是压根就别想，免费空间不要提CURL。其实我压根就不信管理员的鬼话，因为我提到的第一个空间就支持。终于找到现在的空间提供商You Hosting，因为网上找到的这个空间的注册教程都是在它改版前的，所以这里重点说一下不同的地方。 You Hosting是不提供域名的，虽然说可以免费获得Reseller Club的账户，但是买域名还是要花钱的，所以考虑选择另外注册域名跳转到该控件。找到DNIP.NET，注册好二级域名备用，跳转ip一会再设置。在You Hosting进行配置，在Configuration-&gt;Master Domains中添加域名。在这里我着实困惑了一段时间，我一直以为是要加入我注册的二级域名的地址，结果提示无效，试着添加.tk的域名则提示不支持.tk，看来是特意做了限制。最后想到也许先加入一级域名，再添加子域名可行。 在Control里面添加自己注册的子域名，然后复制Account Information中的ip地址，在dnip.net直接选择update，输入好ip更新即可。更新后需要等待一段时间，我试过几次大概在两三分钟就可以成功跳转。 至此，一个完全免费的个人小站就算初步搭建完成了，至于安装什么程序就看个人喜好了。友情提示，免费的东西不要提什么时效了，能玩一阵也是好的，我也听到过说You Hosting会删用户数据的传闻，所以还是要做好数据备份啊。希望本文能帮助到有需要的人。 备注 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录日期：2022年2月20日","link":"/2012/12/%E5%85%8D%E8%B4%B9%E5%BB%BA%E7%AB%8B%E4%B8%80%E4%B8%AA%E8%87%AA%E5%B7%B1%E7%9A%84%E5%B0%8F%E7%AB%99%E6%9C%89%E5%A4%9A%E9%9A%BE/"},{"title":"怀念那些有空鼓捣的日子","text":"上一次不分昼夜爆肝了七天国庆假期的经历还是在2013年，那时候没有疫情，那时候我参加工作刚满两年，那时候我还年轻。","link":"/2022/02/%E6%80%80%E5%BF%B5%E9%82%A3%E4%BA%9B%E6%9C%89%E7%A9%BA%E9%BC%93%E6%8D%A3%E7%9A%84%E6%97%A5%E5%AD%90/"},{"title":"梦魇","text":"原文当我又一次从梦中紧张的醒来，回忆着梦中情景的一幕一幕时，我觉得有必要把它记录下来。首先要说明回忆梦中故事并不是件很容易的事，随着你不断的回想，同时也在渐渐忘记。我很奇怪这种有悖于一般现实场景的体验，就好比你背单词都是越想就记得越牢，唯独梦会难以抓住般的溜走。 虽然标题叫梦魇，但是并没有什么恐怖片中的情景，而是一种隐隐的紧张感，有时是压抑感。隐隐伴随，却寸步不离，直到并不突然的慢慢醒来，想来梦中情景仍旧心悸不已，知道辨明现实才如释重负。 再读旧文 以上内容为旧文搬运日期：2022年2月20日 梦境有一个很有意思的地方，梦中的恐惧、紧张、喜悦、美好的那种感知程度都远大于现实世界。在醒来之后回想梦境，想要再次体会那种感受的时候却怎么也找不回来当时的感觉，就像握不住的沙，流失只在指缝。在抖音上看到过一个多巴胺影响人体感受的视频，深以为然。人体所谓的感官都可以归结为或化学信号或物理信号传递给大脑（这里的专业知识我可能描述有误），就像模数转换一样，把一个模拟的感官反应转化为数字的信号量。最终以这种信号携带的信息给出我们对外来影响的反馈。所以在梦中，你的恐惧是恐惧的信号、你的开心是开心的信号，程度直接关联于信号的强弱。而在你醒来之后，想要复现这种信号病达到那种强度就变得及其困难。","link":"/2012/12/%E6%A2%A6%E9%AD%87/"}],"tags":[{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"建站","slug":"建站","link":"/tags/%E5%BB%BA%E7%AB%99/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"豆瓣","slug":"豆瓣","link":"/tags/%E8%B1%86%E7%93%A3/"},{"name":"记录","slug":"记录","link":"/tags/%E8%AE%B0%E5%BD%95/"}],"categories":[{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"},{"name":"文档","slug":"文档","link":"/categories/%E6%96%87%E6%A1%A3/"},{"name":"记录","slug":"记录","link":"/categories/%E8%AE%B0%E5%BD%95/"},{"name":"旧文","slug":"旧文","link":"/categories/%E6%97%A7%E6%96%87/"},{"name":"电影","slug":"电影","link":"/categories/%E7%94%B5%E5%BD%B1/"}]}