{"posts":[{"title":"免费建立一个自己的小站有多难","text":"原文 当我费了九牛二虎之力终于能开始写下现在的文字时，我觉得要实现这个目标真的没有随口说说的那么简单。对于一个突发奇想要自助建站而又没有任何经验的人来说，面对的问题是根本不知道从何下手，简单描述下我的建站经历吧。 首先要确定目的。如果你只是想写写博客，那没必要走下面的好多条弯路。可以直接使用现成的免费博客，像大众化的新浪博客、偏技术类的cnblogs、甚至QQ空间也都是不错的选择。其实这也是我最初的想法，找个空间记录一些东西，不过事实证明我对于写东西的兴趣远没有我想的那么强烈。很快我就走偏了，找到一个自己能控制的空间成为了当前目标。我走的第一个弯路是新浪的SAE， 在我注册时SAE还不像现在有那么多限制和收费，品牌效应和提供的服务让我感觉终于找到组织了。也是在这里，我才第一次安装了typecho，很奇怪为什么不是wordpress。能在可控的空间自由的选择程序安装对于从类似QQ空间走过来的我，当时真的非常兴奋，暗下决心从此开始玩博客了的念头也是有过的。当然在激动之余，考虑了下云豆的费用，觉得为了三天打鱼两天晒网的花钱实在不值，于是果断放弃，进而开始下面更为艰难的寻找过程。 为什么会艰难，即使是找个免费空间也是百度一搜一大片，所以我也很纳闷我是不是走错了路。我的目标是免费的域名和空间，不要求顶级域名，只要能访问、速度上说的过去就行。第一个选定的是Free Web Hosting Area，这算是一个相当不错的免费空间供应商了，也提供比较好的域名后缀，我当然不喜欢那种数字字母组合的密码式后缀，唯一的限制是30天至少一次的点击，可以说很适合个人建站。本来用得好好的，我也在上面试验了wp、joomla，不过后来ftp就变得非常不好用了，几乎是不停的掉线，到后来干脆连个人域名都访问不了。难道被墙了？不可能啊，我什么还都没写呢，不过发现还是可以通过代理访问的，估计是eighting big期间又墙了一批地址，我的小站也不幸中枪了，只好放弃。 偶然的机会看到一篇文章WordPress建站指南，按图索骥找到kilu.de。又发现一个相当不错的空间，只是在注册上遇到一点困难，网站限制了中国ip，通过代理搞定。注册域名、安装wp都很顺利，导致我再次更换的原因出现在一个wp插件的安装上。Google Analyticator提示“Google PHP API Client requires the CURL PHP extension”，这种问题我显然搞不定，上论坛一看管理员对于类似问题的回复就是压根就别想，免费空间不要提CURL。其实我压根就不信管理员的鬼话，因为我提到的第一个空间就支持。终于找到现在的空间提供商You Hosting，因为网上找到的这个空间的注册教程都是在它改版前的，所以这里重点说一下不同的地方。 You Hosting是不提供域名的，虽然说可以免费获得Reseller Club的账户，但是买域名还是要花钱的，所以考虑选择另外注册域名跳转到该控件。找到DNIP.NET，注册好二级域名备用，跳转ip一会再设置。在You Hosting进行配置，在Configuration-&gt;Master Domains中添加域名。在这里我着实困惑了一段时间，我一直以为是要加入我注册的二级域名的地址，结果提示无效，试着添加.tk的域名则提示不支持.tk，看来是特意做了限制。最后想到也许先加入一级域名，再添加子域名可行。 在Control里面添加自己注册的子域名，然后复制Account Information中的ip地址，在dnip.net直接选择update，输入好ip更新即可。更新后需要等待一段时间，我试过几次大概在两三分钟就可以成功跳转。 至此，一个完全免费的个人小站就算初步搭建完成了，至于安装什么程序就看个人喜好了。友情提示，免费的东西不要提什么时效了，能玩一阵也是好的，我也听到过说You Hosting会删用户数据的传闻，所以还是要做好数据备份啊。希望本文能帮助到有需要的人。 备注 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月20日","link":"/2012/12/how-hard-it-is-to-build-your-own-small-site-for-free/"},{"title":"不要劝人向恶","text":"原文 在看过死亡实验之后，一种很压抑的感觉持续了几十分钟。不同于夜晚回想恐怖片情节，也不同于影院大屏幕影音的震撼，而是一种完全的心理上的影响。在现在这样的花花世界里，一部影片在播放完究竟保有多久的记忆呢，在我不算多的观影记忆中，关掉播放器的那一刻差不多也就告别了影片相关的一切，即便是优秀的片子也只是作为茶余谈资而已，而这一会迟迟走不出电影情节的感觉还是头一次。 在豆瓣上，我给死亡实验打了5星得评价，其实从很多方面来说这个片子都有一些缺憾，比如没有很好的开始、结局的处理也比较仓促、也没有在情感上做过分的渲染，不过这些技术因素在一个绝好的选材面前都不再重要。在当惯了中立观影人时，突然遇到一部直至内心的影片，强烈的共鸣感打动了我。看了看豆瓣上的影评，知道影片以一个真实的“监狱实验”为背景，情节也基本一致，虽然伤亡情况更为突出，不过考虑到影片中实验者为成年人不同于真是实验的大学生，情节并不突兀。影片更多的作为一种记述，实验本身所要研究的简单来说就是环境对人性格的影响，进而有人延伸到当权利不受限制时出现的情况。我想说的是，人性本如何，本恶。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日","link":"/2012/12/do-not-exhort-people-to-evil/"},{"title":"123","text":"原文 很多时候，犹豫会消磨掉我们的意志和想法。记得许多年前又一次逛估衣街，我对于各种商家出售的货品并没有多大兴趣，反而在看到那些古旧的木质匾额和明显滞后于这个时代风格的建筑时，我被深深地吸引住了。仿佛从一个片段就能会放出当年繁华的街市一般，一种探索的感觉隐隐升起。那时，我还小。 在前几天，偶然见到一些藏在闹市之间的格格不入的院落，我觉得是时候要做一些事情，去勾画我的想象了。记录的目的地选定在重庆道，作为五大道之一，自然有不少名人故居、历史建筑什么的坐落于此，不过这些都不在我的记录范围。我要探寻的是那些第一眼就能触动我的，而标准我一时还想不好，反正像“某王府”那种人工修饰痕迹很重的地方，我是没多大兴趣的，反而是与时代或说与光鲜的表面反差很大的才是我关注的。至于水平高低，只能说新手上路、初学乍练。一没经验、二没装备，只能慢慢摸索，希望以后我会做得更好。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日 时隔多年，文中提到的那些事依然没有去做，但依然有想法。已经忘了当初的起因，只记得后来每次看到伴随着自己成长的建筑拆除的时候，那种记录就是保存的想法就每一次出现。小时候住过的房子、瞎跑的胡同、步行几分钟就能到的小学、没有汽车的僻静马路、放学时骑车穿行的小区、大学的南大门，等等等等都慢慢不见了，只剩下脑子里的画面，却也只能日渐模糊。图像的文字的记录可能是一个普通人能够去保留和回忆那些过往最有效的方法了，每一次迟疑每一次明天都可能再一次丢掉一个现实存在的场景。 标题没有改，就是当时随手敲下的“123”，寓意着简单和开始，恰好符合文字想要表达的。重启小站、重启当年的那些个想法，希望这一次会更好。","link":"/2012/12/one-two-three/"},{"title":"梦魇","text":"原文 当我又一次从梦中紧张的醒来，回忆着梦中情景的一幕一幕时，我觉得有必要把它记录下来。首先要说明回忆梦中故事并不是件很容易的事，随着你不断的回想，同时也在渐渐忘记。我很奇怪这种有悖于一般现实场景的体验，就好比你背单词都是越想就记得越牢，唯独梦会难以抓住般的溜走。 虽然标题叫梦魇，但是并没有什么恐怖片中的情景，而是一种隐隐的紧张感，有时是压抑感。隐隐伴随，却寸步不离，直到并不突然的慢慢醒来，想来梦中情景仍旧心悸不已，知道辨明现实才如释重负。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日 梦境有一个很有意思的地方，梦中的恐惧、紧张、喜悦、美好的那种感知程度都远大于现实世界。在醒来之后回想梦境，想要再次体会那种感受的时候却怎么也找不回来当时的感觉，就像握不住的沙，流失只在指缝。 在抖音上看到过一个多巴胺影响人体感受的视频，深以为然。人体所谓的感官都可以归结为或化学信号或物理信号传递给大脑（这里的专业知识我可能描述有误），就像模数转换一样，把一个模拟的感官反应转化为数字的信号量。最终以这种信号携带的信息给出我们对外来影响的反馈。 所以在梦中，你的恐惧是恐惧的信号、你的开心是开心的信号，程度直接关联于信号的强弱。而在你醒来之后，想要复现这种信号病达到那种强度就变得及其困难。","link":"/2012/12/nightmare/"},{"title":"豆瓣SDK doubanOAuth","text":"原文 基于豆瓣API V2提供的接口，使用C#做了下简单的封装。实现了全部已知的方法，大部分已调通，个别实现还存在一些问题。 各种传图的方法，image参数无效，后续版本待修改 Mail，发豆邮频率过大导致需要输入验证码部分未实现 Shuo，block用户不可用（希望有了解block参数设置的同学帮忙） Note，更新日记返回json字符串而不是对象，暂时未处理 本代码需要.Net4.0的支持，最初是为了应用dynamic解决photos的字段命名问题，后来发现用object可以代替，不过可选参数确实需要4.0的支持。 关于更新：我当然希望把这个sdk做好，只是在这个过程中感到豆瓣提供的信息很少，困难很多。考虑到V1的api即将停用，估计V2版本会有较大程度的更新，我也会适时的跟进 关于代码： 所有的方法的是static的，调用比较方便，对于有洁癖的同学或许有点不适，我也在想改进的办法 HttpWebRequest的构造中，referer用了我自己小站的地址，不喜欢的可以修改代码 提供了Common.LastError 以查阅最新的错误信息，按说应该提供事件支持的，我还没想好是采用事件还是Exception的方式，以后会完善 方法名前缀缩写说明 User Usr Authentic Auth Book Bk Music Mus Movie Mov Collection Col Annotation Anno Event Evt Discussion Disc Online Onl Photo Pho Comment Comm 关于文档：我不善于写文档，却对文档有着精品情节。对于现在这样一个姑且称之为半成品的东西，文档暂时没有，好在代码里注释还算丰富，也尽量做到了自解释命名 源码：https://github.com/cath-gh/doubanOAuth 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日","link":"/2013/01/douban-sdk-doubanOAuth/"},{"title":"对于豆瓣API的一些看法","text":"原文 第一次接触到豆瓣API应该是在它的小组，当时还是V1版本，提供的函数也很有限。原本我想要做一个功能上类似豆瓣的本地程序，其实即便在当年来看winform也不再是趋势了。我的初衷是，豆瓣对于图书、音乐的条目是以实际发行版本作区分的，这就会导致明明是一个作品却拥有多个条目。比如说台湾地区的音乐专辑，很可能会区分出一个大陆版来，而即便不区分，也会有各种各样的白天、黑夜、微笑、哭泣版本出现。如果说不同的版本确实有一两首歌的不同，确实需要区分对待，音乐勉强可以接受，不过图书就没那么多迫切的需要了。不同的出版社、不同的年份，我看的都是三国演义，我想记录的是我看了这本书，而不在乎其他信息。当然在译本书籍上区分还是必要的，毕竟译者的不同往往决定着文字的质量，这个可以借助额外的描述，书的名字仍旧只采用一个。 我当时的想法就是做一个条目更清晰豆瓣版本，应该是百度链接到了豆瓣API小组，也第一次接触到了OAuth。想做和做出来毕竟是两回事，可以说基本上不会写代码的我还专门百度知道问了下什么适合做这种应用，也是因为那个回答让我走上了学习C#的路。因为能力准备不够，所以很快就放弃了。第一次尝试失败了，但是我提了一个问题，现在看来这么多年过去了，豆瓣还真是没啥变化。豆瓣的APP除了一个fm，其他的那个也没触碰到豆瓣发家的核心部分——三大门类的收藏和评论。什么态度？其实也就是不太支持网友们自己瞎搞。 直接跨接到现在的V2版本，提供的方法更少了，权限限制更严重了。豆瓣最初的想法可能是放出一些借口，看看网友们能不能做出点新鲜的东西，但是自己核心的东西又舍不得放，即使是周边功能也是有这个没那个。就那么几个干巴巴的借口，豆瓣以为网友都是数据挖掘的大神啊，看看豆瓣API小组几天不翻页的帖子和各种没人回答的问题，你还在奢求什么呢？ 我第二次关注豆瓣API时，OAuth版本已经变成了V2。看了看文档，认证上更方便了，返回json格式文本也方便解析，难道晴天来了，那就再来过吧。我真的没想到重蹈覆辙竟然这么的容易，如果说豆瓣API的文档中看不中用，那么看看新浪微博的文档，就觉得这样的评价也高抬了。返回的json字段和你描述的不一样不要紧，我直接人工看一遍也ok；V1到V2部分类共存也不要紧，我多写几个也能对付；返回字段时有时无也不要紧，用了Newtonsoft.Json后一切搞定；你返回的photo字段格式变态也不要紧，我用dynamic(实际用object即可)加正则一样搞定。可是在我克服了重重困难之后，迎接我的却是各种莫名其妙的情况。更新日记不返回json对象，而是一堆\\之后的字符串；部分搜索类方法不加token跑的通，加了就不行；返回的count、total不准确；最离谱的就是个别方法一直不正常工作。我所能想到的就是，豆瓣官方对于这个项目是没有多少支持的，甚至是不支持的也未可知。 前面有一段忘了说，就是在第二次尝试时，我起初用的是正则表达式的法子，后来觉得太麻烦(豆瓣三大类页面代码极大的不同)，才考虑使用API的。现在看来API+正则似乎是比较完美的方案，正则不怕别的，就怕突然改版，不过只要不是大面积的应该都能应付。 最后说点闲话吧，用豆瓣这些年有过一个想法。豆瓣不是搞技术的地方；豆瓣人文气息不浓，小资、假文艺、装的都不少；豆瓣不搞文化，自然没有也出不了大家；阿尔法城是豆瓣的败笔，从测试开始我就是这么看的；九点是个好地方，应该融合到主站里面，在丰富一下内容就更好了；豆瓣FM本来很好的，现在广告太多了，也推出了收费的版本，呵呵。 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日 豆瓣API似乎真的已经荒废了，可能是没能发现和带来真正有价值的产品，无论是豆瓣自己还是寄希望于外界开发者。豆瓣最有价值的数据却没有得到更进一步的挖掘与展示，这是可惜的；豆瓣沦为水军、软文的战场之一，这是可悲的；豆瓣在炒作元宇宙概念之前很多年就砍掉了自己的阿尔法城，这是可叹的。 我喜欢豆瓣，在当年看到回顾阿北在豆瓣胡同的咖啡馆敲出了豆瓣网站的文章时，更是沉浸于那种既文艺又生活的感觉。后来小众网站走红了、林子也大了、商业化的压迫又难以避免，反应滞后、方向摇摆、东施效颦这些文字用来描述豆瓣这些年的决定丝毫不过分。 我喜欢豆瓣，我希望它还能好起来，在商业化的时代完成利益与梦想的调和。","link":"/2013/01/some-thoughts-on-the-douban-api/"},{"title":"doubanOAuth更新","text":"原文 源码：https://github.com/cath-gh/doubanOAuth 2013.01.26 终于调通了发图的部分，另外增加了ErrorCatched事件。 关于发图： 首先说给书记写笔记时，图片顺序无所谓，但是图片编号必须从1开始，且不间断 发日记中带图，pids参数传递图片编号，类型为List&lt;int&gt;，不要求起始数字，也不需要连续。layout、desc、imagePath要求其数量与pids一致。 已知问题： Shuo，block用户仍然不行，依然需要知情人的帮助 日记发图，不清楚为什么在日记内容末端会自动添加所包含的图片 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日","link":"/2013/01/doubanOAuth-update/"},{"title":"Markdown 参考文档","text":"最大标题 第二大标题 最小标题 这是粗体文本 这是斜体文本 这是错误文本 此文本 非常 重要 所有这些文本都很重要 Text that is not a quote Text that is a quote 使用 git status 列出尚未提交的所有新文件或已修改文件。 一些基本的 Git 命令为： 123git statusgit addgit commit 本站点是使用 GitHub Pages 构建的。 George Washington John Adams Thomas Jefferson James Madison James Monroe John Quincy Adams 第一个列表项 第一个嵌套列表项 第二个嵌套列表项 [x] #739 [ ] https://github.com/octo-org/octo-repo/issues/740 [ ] Add delight to the experience when all tasks are complete :tada: First Header Second Header Content Cell Content Cell Content Cell Content Cell Command Description git status List all new or modified files git diff Show file differences that haven’t been staged Left-aligned Center-aligned Right-aligned git status git status git status git diff git diff git diff Here is a simple flow chart: 12345graph TD; A--&gt;B; A--&gt;C; B--&gt;D; C--&gt;D;","link":"/2022/02/index/"},{"title":"Hello Cath","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new &quot;My New Post&quot; More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment","link":"/2022/02/index/"},{"title":"一个字，过瘾","text":"没想要写影评的，只是短评写不下了。 片子很过瘾，五星推荐。首先我并不把它定义为励志片，而是更像讲述两个偏执人的故事。前一秒温情脉脉后一秒狂暴发怒的模式并不意外，因为现实中很多人就是这样。不仅是弗莱彻，主角的偏执同样明显，从开头的练鼓到与女友分手时的冷漠表现的毫不掩饰。 所谓不疯魔不成活，想要做到行业翘楚，我是赞同这句话的，但是我并不苟同弗莱彻的教学方式，或者说是他的行事逻辑。查理帕克之所以成功，是因为他是查理帕克，顶尖人物天生的执拗是不会被现实抹平的。弗莱彻自认为的去尝试了，如他所言的没有找到下一个查理帕克，而即便进入林肯中心的优秀学生也最终自杀身亡。不成功是学生的问题，成功了就是老师的功劳，这就是他的狗屁逻辑。他掩饰了肖恩的死因，一句车祸轻描淡写，他如果说出肖恩是上吊而死，在场的学生还会因为弗莱彻的眼泪感动么。 弗莱彻的另一个黑点在于最后酒吧重遇主角的设计陷害，他想要彻底摧毁尼曼，在意义重大的场景下。所以最后如果不是主角的绝地反击，还会有人去推崇弗莱彻所谓的逻辑么。 是不是导演疏忽了弗莱彻影响的塑造呢，比如他强大的音乐能力等等。我认为不是，展现出来的恰恰是导演想要表现的，正所谓瑕不掩瑜，反之亦然。片中主角父亲找来第三方（我忘了具体单位的名字）与尼曼交流，了解讲述了肖恩真正的死因，并希望尼曼提供一些证词。这个桥段的设计很巧妙，我也真是从这里不在定义本片为励志片。包括最后舞台之上弗莱彻反面boss一般的道出，他已经知道是尼曼提供了证词的情景，都暗含了导演对片中两人的价值观判断。 即便可以以成败论英雄，但不能以成败论英雄周边的人。主角的浴火重生是属于他自己的荣耀，用片中的词就是earn，这不是其他人的恩赐。作为老师的弗莱彻可以接受学生的感谢，但不能索要。 导演把冲突塑造的很棒，结尾收的干净利索。虽然吐槽弗莱彻，但不得不说看得很是过瘾，哈哈。","link":"/2022/10/index/"},{"title":"怀念那些有空鼓捣的日子","text":"上一次不分昼夜爆肝了七天国庆假期的经历还是在2013年，那时候没有疫情，那时候我参加工作刚满两年，那时候我还年轻。 距离写下上面那段话已经过去七个半月了，拖延症和一些无法抗拒的原因并不使我感到愧疚，而是——忘却（突然想发一下微信捂脸哭的表情）。懒惰的确是更主要的原因，我在年初决心在github重建小站的时候就想过要写一篇搬家文，记录为什么选择了这个地方、为什么要去做记录、怎样完整的部署这套“系统”等等。然而在七个半月过后，不仅当初的热情逐渐理智化，就连怎样发出一篇文章也几乎忘记了，想要复现那些豪言壮志的心路历程就要再次的各种百度和试验。为了记住而要做的记录，因为忘了做记录，终于没记住，真是个悲伤的故事。 每次发文都要费力的选一下封面用图，可能很多人对这张图片感到陌生，但那种古老的感觉还是很清晰的传达出来了,这就是我“鼓捣”的起点——Windows 3.2。严格来说这仅仅是我接触到最早的操作系统，真正使用和上网都是在Win 95时代完成的，然而早期的接触电脑并没有带来什么光辉的后续故事，毕竟玩玩扫雷打打字早个几年也没什么两样。 文章开头提到的那次耗尽七天国庆假期的经历，是在我刚进到一个新部门的时候。日常工作会频繁地查询更新一堆excel表格，还有另外两位同事也需要做同样的工作，所以不可避免的手工输入错误、版本之间的差异以及统计上各种繁琐的问题接踵而至，于是就有了做一个大学课程设计常见的xx信息管理系统的想法。 实现难度上和创新上都没有任何值得吹嘘的地方，当然这是和会的人讲，在普通不谙编程的周围人看来，这简直就是大神行为，其实对我自己来说也是。 虽然一直号称热爱计算机，但在这次经历前我也只算听说过各种名词，在校期间的脚本片段和一个完整的“系统”有着明显的不同，所谓麻雀虽小五脏俱全。我不会数据库、不懂html、没用过css、不习惯javascript、没学过angularjs，好在搜索工具、MOOC课程和github给了我足够的帮助，灵活闲在的工作也让调试变得充分，在处理掉angularjs的dirty check后终于推出了这套系统的第二个版本——最终版。 当一个系统能正常使用之后，边边角角的便捷性改善就变得无足轻重。或许是兴趣点转移了，或许是惰性再一次出现，总之后面再没有新版本诞生了。本着生产系统保持稳定的想法，连工具库的版本都没有更新过，这种“稳定”一直持续到2007年。 经过对数据库课程全面的学习，我决定对系统的数据结构进行一次大规模的升级。然而一种直觉告诉我：不要瞎耽误工夫。在我考虑用怎么样的结构去定义数据时，总用另一半心思预感我即将离开这个部门，而对这些数据费时费力的升级都将变得毫无意义。这种感觉持续了大概半年多（具体时间记不清了），我果然离开了那个拥有者充沛学习时间，足够鼓捣各种新鲜玩意的地方。 曾经的、还存留在记忆中的那个场景——父母在客厅里看电视，我在自己卧室的写字台前，在台灯的白色背光下，噼里啪啦敲击着笔记本的键盘，时而停滞下来思考每一个功能如何实现、时而吃一口母亲送进屋来的水果，终于在一次跑通测试后，满意的关上电脑，双臂后夹伸展一下微酸的后背，拿着水杯回到客厅感受临睡前的阖家时光。 这是我记忆中最美好的场景之一，从上学时期的记录一些文字切换到敲代码，场景的特征依然留存，每一样都不曾变动。只是过了许多年后，父母渐渐老去，我也已成家不再住在家中，每次想来都觉得有些伤感。 怀念那些有空鼓捣的日子，和怀念看灌篮高手一样，那是我的青春，那时我还年轻。","link":"/2022/02/index/"},{"title":"《黑镜》第二季 21世纪的哲学系寓言小故事","text":"故事一 男主一出场就看出快要死了，这是我们法制教育的脚本，黑镜的处理要更丰富一些。基本上还是延续了第一季“科技进步个现实生活带来冲击”这一主题，这一集的黑科技真的很恐怖，除了真人部分，文字聊天和电话说不定过上几年就能出现了。只有一个疑问，会不会像克隆人那样，涉及到伦理问题。 故事二 最喜欢黑镜系列的一点就是每一集表现的内容非常多，但是却不影响主线的展现，这一集大概是“到底什么是正义”。峰回路转总是有意思的，意想不到的就更精彩了。观众疑问了几十分钟、对女主也可怜的几十分钟，最后大幕拉开依然不知所措，好像我们就是被愚弄的那个人。日历上标记的那个桥段真是点睛之笔，意味着者中可怕的重复已经十几次了。白熊正义公园的名字也是讽刺的一个点，究竟什么是正义、由谁来宣判正义，这真的是一个问题。 故事三 这个故事放到黑镜系列里面有些不伦不类，缺少那种科幻世界的设定，不过故事本身却是一个延续了很久的主题。上学时听老师讲到过，所谓民主，在不同的历史阶段、在不同的文化民族下，它所展现的意义是不同的。简言之一句话，民主没有想象的那么靠谱，详见《乌合之众》。","link":"/2016/01/index/"},{"title":"走弯路也是前进的一种方式","text":"写在前面的话 这并不是一道选择题，有时候只有一条路甚至迷雾重重找不到方向，在临近终点时才终于发现了捷径，之后我们把这个归结为经验。 缘起 最近在玩一款手机上的页游，翻看了一下游戏中赛季的记录居然已经有三年了。还清晰地记得上一次退坑狂野飙车8的时候，现在想起来狂野飙车仍旧是一款可玩性非常高的游戏，然而无休止的活动带来的每天早中晚工作一样的“打卡”操作终于让我深感疲惫。在那个氪金趋势愈发明显的时代里，有这样一款靠肝和技术还能对抗氪佬与欧鳇的游戏是相当难得的，然而每日定时的肝真的会耗尽玩家的热情与精力。熟悉那款游戏或者其他竞技类游戏的玩家应该有同感，为了出成绩就要高度集中注意力，进而带来的就是精力的快速消耗，放下手机、推开键盘、从座位上站起时的那种疲惫感是不是相当熟悉呢。于是，我为了充分的休息换了一款收菜游戏，三年后它变了。 改变是慢慢出现的，游戏最初的玩法几乎相当于没有，每天就是点几下收工，和旅行青蛙也没有多大差别。或许是为了玩家、或许是为了盈利，游戏中的玩法逐渐丰富了起来。游戏策划并不喜欢修复不利于玩家的bug或者优化游戏体验，而仅仅热衷于开发新玩法。从游戏中的数据推算，氪金点的丰富也的确大大提升了玩家的支出。当然，伴随而来的收菜复杂度也逐渐上升，加之游戏本身时不时就会卡死，三年前那种疲惫的感觉再次袭来，似乎又到了弃游的时候。 然而就在此时，普罗米修斯盗来一段代码从天而降，从此有了火，开启了新的时代。 石器时代 石器时代，是考古学家假定的一个时间区段，为考古学上的术语。分为旧石器时代、中石器时代与新石器时代。是考古学对早期人类历史分期的第一个时代，即从出现人类到青铜器的出现，大约始于距今二三百万年，止于距今5000至2000年左右。 一段代码的出现，让玩家迎来了石器时代。 123456789int1 = setInterval( () =&gt; { if (document.querySelector('.cardwar-pve-boss-challenge')) { angular.element(document.querySelector('.cardwar-pve-boss-challenge')).triggerHandler('click'); }; if (document.querySelectorAll('.btn span')[2]) { angular.element(document.querySelectorAll('.btn span')[2]).triggerHandler('click'); }; }, 1000) 一切都是从这段代码开始的，它让我知道了两件事：第一，游戏使用angularjs框架；第二，可以通过代码触发页面内的点击操作。于是angular.element().triggerHandler()成为了最早的工具，古朴而直接。着这里感到非常惭愧，作为一名自诩为计算机爱好者居然没有主动去F12一下，事实证明就是单纯的水平低，哈哈。 顺着这条路的方向，我开始研究游戏内各种页面跳转的逻辑，衍生出了一些新的工具：页面状态检测、间隔函数立即执行、根据状态终止间隔函数等等。 123456789101112131415var delayInterval = function (interval, state, callback, sleep) { var _int = -1; intStart = () =&gt; { _int = setInterval(() =&gt; { if (state()) { clearInterval(_int); callback(); setTimeout(() =&gt; { intStart() }, sleep); } }, interval); } intStart();} 游戏内的机制并不能随时随刻的进行测试，只能在可操作的那段时间反复验证代码的健壮性。总体来说改进后工具的执行效果还是令人满意的，然而游戏自身问题导致的一些错误总是很随机的出现。如同智子对实验结果的影响，知道问题会出现却又无法避免，直到另一段代码的出现。 青铜时代 青铜时代具备这样一个特点：青铜器在人们的生产、生活中占据重要地位，偶然地制造和使用青铜器的时代不能认定为青铜时代。 12345var xmlHttp = new XMLHttpRequest();var date = new Date();xmlHttp.open('GET', `https://` + servURL + `/PlayerFight/killBoss?post_time=${date.getTime()}&amp; TEAM_USER_TOKEN=${token}&amp;os=m`, false) 并不是要马后炮，httpRequest的方式我曾经考虑过，因为有过模拟登录和抓包的经验，实现起来并不困难。然而当时一直沉溺在triggerHandler的新鲜感中，那种定时开启、自动跳转的视觉效果比后台默默执行更具穿透力，但是这种方式有一个明显的问题————效率不够且独占前台。 在此之后，新工具雨后春笋般得出现。游戏中各种收菜操作得到了空前的简化，以往二三十分钟的工作点几下脚本轻松搞定（这里推荐一下ios上的Alook浏览器，6元的价格物有所值）。这时我的感觉就如同“物理大厦已经落成，所剩只是一些修饰工作”，每完成一个脚本就进入寻找下一个简化操作的流程。然后我就遇到了问题，“它的美丽而晴朗的天空却被两朵乌云笼罩了”，甚至不止两朵。 在使用新工具披荆斩棘的路上，惊奇的发现游戏中有一些操作是不产生request/response包的。游戏代码并不能离线执行，如果不是通过req的形式，那就一定有其他方式传递数据。翻遍了Chrome Devtools的每一个角落，依然没有线索，只好把问题暂行搁置。 天降神秘代码推动发展的时期已然成为过去，后面的路要靠自己一步步走出来了。如同每一个偶然的事件激发了人类进步一样，我找到了那个开启下一个时代的钥匙。 铁器时代 当人们在冶炼青铜的基础上逐渐掌握了冶炼铁的技术之后，铁器时代就到来了。 在即时通讯网学习过一些关于Websocket的知识，却从来没有接触过实际应用的例子，以致就缺乏足够的敏感。在我找寻那些不使用request方式进行通信的线索时，已经几乎找到答案了，但依旧视而不见，可谓不识朱砂只当是红土啊。 在这个WS的标签页，第一感觉是为什么只有一个请求包，即便在点击了消息页之后也没有仔细查看，转而去看其他页面了。 我时常使用FM游戏中的一项球员属性来形容自己————预判19（最高为20），在此刻看来真是无知而傲慢啊。如果不能用已有的知识举一反三，如果不能敏锐的发现眼前的蛛丝马迹，如果不能独自解决问题，何来自夸的高预判啊。在这次走弯路的几个重要节点上，上面这三个痛处几乎全部命中。 弱小和无知，都不是生存的障碍，傲慢才是。 ————《三体》 总算终于还是发现了这把钥匙，游戏中那些不寻常通信模式的的数据在这里一览无余。初始化、心跳连接、游戏数据，一切都显得顺理成章，星光坦途尽在眼前。 随即模拟登录的经验继续操练起来，建立连接、模拟发包、接收数据处理都不在话下，然而还是遇到了一个棘手的问题————游戏中在已有websoket链接的情况下不允许建立通信。像爬了81层楼发现没带钥匙一样的沮丧，既往的努力变得毫无意义。 尝试各种方法试图强制现有链接掉线或者直接关闭连接，习惯性的搜索、满怀希望的尝试、失败继而失望、继续搜索往复循环，在我以往的编码经历中有过无数次这样的循环，身心俱疲、后背微酸的感觉也再次袭来。乌云遮住了晴朗的天空，不知道何时放晴。 拨云见日终有时，守得云开见月明 云天明精心编制的童话故事给了人类线索和希望，怎样解读就要靠人们自己了。 石器时代朴素古拙的武器重现，敲开了通往新世界的大门。 蒸汽时代 在这个时期，资本主义的机器大革命开始出现，资本主义的世界体系开始初步确立。一种新的动力机器：蒸汽机的发明和应用，将人类带入了蒸汽时代。 也许除了triggerHandler，angular的另一件武器scope才算是它的杀手锏。 在开始探索各种触发函数的时期，我也注意到了通过scope可以直接调用一些游戏原生的方法，而且比之触发点击来的更为精确。同时我发现总有一些输出日志的函数在scope范围内不存在，由于对angular的不甚了解，于是便寄希望于rootscope，因此进入了一个不断找寻引用rootscope办法的误区。 或许找到了依然视而不见，我并不想去深入研究angularjs的原理，毕竟这算是一个半退役状态的框架，不值得在上面耗费时间。代价就是钝刀砍柴，磨刀的时间也没能省下来。 终于在无数次大力过后奇迹出现，操作原有websocket连接和angular的scope相交在了一起，scope中的websocket示例居然可以直接调用。 各种实例方法和事件监听函数唾手可得，不再等待，clsoe掉原有的，然后用自建的函数重新连接，静待着定制的粗体蓝色的log文字出现。然而期盼依旧的onmessage函数却没有如期运转，在几分钟过后，粗体蓝色的文字“连接已关闭”打印在了屏幕上。 这一次高预判及时出现，既然已经获得了websocket示例，又何必去关闭它，直接用不就得了。 12var a1=$scope.socket.onmessage;//省大事了$scope.socket.onmessage=function(e){console.log('接管了');a1(e);} 在看到“接管了”成功输出之后，我知道又一个新的时代开启了。奠基性研究成功后，各种应用性研究便会如约而至，我毫不怀疑这一点。 写在后面的话 写下这段文字时，距离上面“接管了”那段代码已经过去两周了，为了记录下前面走过的种种弯路，我决定在完成这篇文字前不继续后面的探索。后面的路线和问题都是未知的，确定的是那会是一个充满希望的方向。 走弯路也是前进的一种方式，所有的经历终将汇聚成宝贵的经验。","link":"/2022/09/index/"},{"title":"又到一年告别时","text":"岁末岁初总是个容易大发感慨的时刻，2014年于我而言终究是普通的一年，一切事情都有条不紊的运行着，继续好或是继续糟的波澜不惊着。也许正是这样的平淡，更容易体会到时间的流逝，白驹过隙形容的恰到好处。 我偶尔会梦到过去的事，大学时代出现的最多，我也会去细细的回忆更早的学生时代的一些事情。我常常设想如果设定一个回到过去的时间点，最好是在幼儿园，最差也要回到大一。要纠正的“错误”太多，自然是回去越多越好，每次假想到这时我也会审视现在的自己，看得到旧日的幼稚和错误并不能阻止继续犯下新的错误，这就是生活的一部分。 昨天刚刚看完了一部08年就完结了的美剧《太空堡垒卡拉狄加》，感触很深，想要写些东西来记下一些细节，现在手头没材料，节后再补上。以前就会有看过一些电视剧或者书籍，有一些话就印在脑子里。比如看了《少年张三丰》，记住了一句“我不杀伯仁，伯仁因我而死”；看了《神雕侠侣》，记住一句“为国为民，侠之大者”和“重剑无锋，大巧不工”。而另外一些引发共鸣的，不是一句两句话的，而是一个情节的东西就容易被遗忘。我现在才发现写读书笔记，包括写观后感这类东西的重要性，重要的是自发的记录下内心的想法。所谓文思如泉涌，涌过了便没了，想找回来实在太难。静谧的夜晚，橘黄色的灯光下文字跃然纸上、跃然屏上的感觉让人沉溺。 今天看到一篇博文，标题是“两年计划好是有用的，万一实现了呢”，内容没关注，标题却很警醒。自己似乎从来没有做过什么计划，按部就班的走到现在也没有多大的不妥。现在想想，恐怕还是计划下比较好，两年是一个很好的点，不算太长却又足够实现一些目标。我妈总说“夜晚千条路，不误白天卖豆腐”，晚上容易说的天马行空，到了白天就变得循规蹈矩起来。 希望2015年能够更好一点。 莫听穿林打叶声，何妨吟啸且徐行。竹杖芒鞋轻胜马，谁怕？一蓑烟雨任平生。 料峭春风吹酒醒，微冷，山头斜照却相迎。回首向来萧瑟处，归去，也无风雨也无晴。","link":"/2014/12/index/"},{"title":"怎么看待这世界","text":"标题过于宏大并不妨碍我内心的看法，每个人都有着自己对于世界的看法，所谓世界观。常规的看，宣扬的、实际的、个人体会的往往不能吻合得很好。这里面既有客观限制，也有主观的倾向。理性一点的说，由于个人认知的时间空间的局限，世界是一百，一个人能体会五十的话，当然没办法勾勒出精确地世界观；主观的讲，个人好恶和动物性的体现很大程度上，在我们最初的体会上加了偏移。所以归结来看，认不清世界没什么，客观的表达自己主观的想法就可以了。 回忆过去，发现真的有很多想法是小时候就出现了。记不清是在小学还是初中时期了，当时就萌生出了一个观念，“做人没有唯一正确的方向”。在那个好好学习天天向上的时期，我越发的感到要成为一个邻居家的孩子，路不止一条。然而体会到那些并没有知道我变得更好，惰性其一，知行没法合一其二。 后来也许是听了太多传统评书，开始相信命运。倒没有宿命论名字显示的那么消极，我个人更倾向于运气就是左右质变的那把钥匙，促成或者毁掉一个人的所有努力，就是那么的轻而易举。人要给自己找原因找借口可以想象力无边，不归咎于命运或者运气无非是给自己一线希望。其实有些事没法解释，中国字“就”很多时候可以派上用场，你不知道为啥，对，实际上“就”是这样的。我相信运气，但并不深信一辈子的命运好坏或者时来运转这些论调，我可以把每单次事件归结于运气的好坏，但并不以此进行推演。虽然我常常自叹自己是个运气很不好的人，但是仔细想想也有好运的时候，毕竟坏的事情更容易被记住。 命运是生来写就的还是即使运算的？以最悲观的观点来看，就算是天注定，个人也不知道未来会发生什么。我的观点更倾向于一点点的运气事件连接在一起，写就你人生每个阶段的命运，命运是总结而不是预言。努力的继续去努力，含着金钥匙的继续去拥抱生活。 我曾经相用平衡的观点的解释生活，应该是受到了经济学中价值中枢的影响。慢慢发现，这种观点过于静态，无异于刻舟求剑，刻意的拉长周期去验证是行不通的。于是改了一个字，开始思考制衡的世界。制衡是动态的，是处在变化中的，更贴近实际状态。","link":"/2017/06/index/"},{"title":"还有多少未竟的事业","text":"缘起 似乎总是在心情不佳的时候才有写字的冲动，特别是在夜晚，一个人在台灯前思绪万千。冲动两个字特别精确，所谓一鼓作气再而衰三而竭。本人没有写东西的习惯，只是觉得脑子里冒出了那么多或连贯或跳跃的话，与其影响睡眠不如干脆记录下来，以后来能来再看看也好吧。 还有多少未竟的事业啊 事业谈不上，甚至压根就没有，未竟的事却有一堆，剪不断理还乱的那种。虽然我不懂什么是宿命论，但我仍旧相信我是个坚定的宿命论者。我曾经在跟同学讨论游戏的时候就说过“运气才是最重要的”，理所当然的他并不认可，估计我这话放到大街上去说，认可的人也没几个吧。 运气，更直接的体现在单个事件上，而命运就是有一个个事件的运气拼凑成的。反对运气说的最容易想到的就是努力说，我从来不反对勤奋努力的态度，而且一直支持并践行着。我强调的是最重要的部分，古语所谓天时地利人和，评书爱说时也运也命也。运气就像化学中的催化剂，就像医药中的药引子，没有就不行，对结果的影响是直接的成败，而不是程度上的强弱。努力让我们更接近目标，运气就是临门一脚。 我们不都是祖国的花朵 有一次在小学门口等人，正赶上学校放学，看着家长们等待和接走孩子们，我突然间有了这样的想法。王侯将相宁有种乎的呼喊不知道激励了多少白家子弟，以学取仕让普通人或者说是让大众有了登上大舞台的机会，我们在学生时努力或不努力的追逐着自己或家庭的梦想。老师是园丁，我们是祖国的花朵的观念已经深入每个人的心中，然而真的是这样么。 学校和老师从来都把学生划出了三六九等，不是要谴责谁，他们做的没什么不对，只是看人未必准确而已。我说幼儿园就存在阶级你信么，我也只有个一次幼儿园时代，我说的就是我所在的那个小班的情形。当然会所阶级严重了，毕竟三五岁的小孩不懂什么叫阶级，可是猴子们也不懂啊。从动物角度来说，小孩子们的行为更贴近本能，也就是动物的本能，把当时的行为放到成人世界里被称作阶级，恐怕就没有人会觉得有什么不妥了。 人没法选择自己的出身，不仅限于富爸爸穷爸爸，高矮胖瘦、智商情商等一概基因论的东西你都没法选择，生来是什么、未来是什么大概已成。这也就是为什么有人小时候就能凸显领袖气质，你没看错，就是领袖气质。我小的时候就愿意当小兵，跟着别人后面跑来跑去。虽然现在近乎油盐不进了，而且最厌恶的就是被约束、被胁迫，却也距离领袖练成之路越来越远了。 就算我们不是花朵，也并不妨碍我们追逐心中的梦想。既有知足常乐、难得糊涂的俗语，也有生活还要继续的现实激励。功成名遂固然可喜，淡泊释然也极为难得。 最后以曹植的白马篇结束我的胡言乱语 白马饰金羁，连翩西北驰。 借问谁家子，幽并游侠儿。 少小去乡邑，扬声沙漠垂。 宿昔秉良弓，楛矢何参差。 控弦破左的，右发摧月支。 仰手接飞猱，俯身散马蹄。 狡捷过猴猿，勇剽若豹螭。 边城多警急，虏骑数迁移。 羽檄从北来，厉马登高堤。 长驱蹈匈奴，左顾陵鲜卑。 弃身锋刃端，性命安可怀？ 父母且不顾，何言子与妻！ 名编壮士籍，不得中顾私。 捐躯赴国难，视死忽如归！","link":"/2014/05/index/"},{"title":"《人生有何意义》书摘记录","text":"偶然间看到了胡适先生的这部书，更准确的说是一部合集、一部文选。其中每一个章节都有自己的主题，书名只是这一串文字的引子。在学生时期的语文、历史课本上认识了许多人名和对他们的标签定义，慢慢的就算是简单地标签也忘记了大半，记得一个名字便是知道这个人了。胡适，推广白话文的；陈独秀，早期的革命领袖。三五个字的描述算的上知道这个人么，在看这部书的时候我想到了这样得疑问，他的文字中表现出来了更丰富更立体形象。 在我现下的思维中，究极问题是没有答案的，至少是很难回答的。人生有何意义并不比如何过好这一生来的更有指导价值，如同方法论之于结果一样，从具体问题到普适化的研究更有乐趣，书中颇为详细的阐述了这一过程。 上回太炎先生谈话里面说现在青年的四种弱点，都是很可使我们反省的。他的意思是要我们少年人：（一）不要把事情看得太容易了；（二）不要妄想凭藉已成的势力；（三）不要虚慕文明；（四）不要好高骛远。这四条都是消极的忠告。我现在且从积极一方面提出几个观念，和各位同志商酌商酌。 这四条我都认可，摘录这段的想法是看待事情角度的不同。古代有性善论性恶论之争，我们看问题有的偏积极一些有的偏消极一些，都是出于本能，于看法对错也没有关联。比方有人说商家多奸商，有人说商家信誉好产品真，没有对错，仅仅是习惯性的出发角度不同。我本人更倾向于积极的看一个事件，也并非没有对阴暗的提防，而是从正面思考能减少很多怨气，让自己心情好才是正经事。 逻辑即是思想、辩论、办事的方法。一般中国人现在最缺乏的就是一种正当的方法。因为方法缺乏，所以有下列的几种现象：（一）灵异鬼怪的迷信，如上海的盛德坛及各地的各种迷信；（二）谩骂无理的议论；（三）用“诗云子曰”作根据的议论；（四）把西洋古人当作无上真理的议论。还有一种平常人不很注意的怪状，我且称他为“目的热”。“目的热”就是迷信一些空虚的大话，认为高尚的目的，全不问这种观念的意义究竟如何。 首先我的观点是一切事件都是有逻辑的，这一段的重点在于“迷信”。传统上说的鬼神迷信是狭义的，广义的迷信是对一切说法不经证实、无条件的相信，包括所谓的科学在内。科学本身是客观而可信的，无论是严格的数学证明还是真实的实验结果，我所讲的科学迷信是指轻信“科学类言论”。比如公众号发布的消息、官博的新闻等，“专家”这的名号的倒掉就是其言论反复、前后矛盾的结果。近几十年中西文化的碰撞产生了很多迷信的圈子，制度的优劣、医术的高低、人种的区别等等，不加思考而接受并保卫的行为便是迷信。破除迷信的口号现在依然不过时，倡导思辨、追根溯源的思维方式才能对抗迷信。迷信思维所以牢固，在于它恰恰是最省事最简单的。好比高晓松讲的精彩，我们便相信他的结论，知乎上一条条指出了他的错误，我们便一棍子打到。这样前后的变化都是迷信的行为，要做到能独立思考，那些指正他错误的人做到了，我们这些看官要学习的是那背后的过程，而不仅是最终的结果。 现在中国有几种人生观是“少年中国”的仇敌：第一种是醉生梦死的无意识生活，固然不消说了；第二种是退缩的人生观，如静坐会的人，如坐禅学佛的人，都只是消极的缩头主义，这些人没有生活的胆子，不敢冒险，只求平安，所以变成一班退缩懦夫；第三种是野心的投机主义，这种人虽不退缩，但为完全自己的私利起见，所以他们不惜利用他人，作他们自己的器具，不惜牺牲别人的人格和自己的人格，来满足自己的野心，到了紧要关头，不惜作伪，不惜作恶，不顾社会的公共幸福，以求达他们自己的目的。 这段话攻击力是很强的，有感于“佛系”的火热所以记录下来。 个人的行为和社会的习俗，都最容易陷入机械的习惯，到了“机械的习惯”的时代，样样事都不知不觉的做去，全不理会何以要这样做，只晓得人家都这样做故我也这样做。这样的个人便成了无意识的两脚机器，这样的社会便成了无生气的守旧社会。我们如果发愿要造成少年的中国，第一步便需有一种批评的精神；批评的精神不是别的，就是随时随地都要问我为什么要这样做？为什么不那样做？ 杠精当然是不受欢迎的，同样在疑问出现时，“别人都那么做我也那么做”也不能成为很好的理由。 庄子虽有“吾生也有涯，而知也无涯，以有涯逐无涯，殆已”的话头，但是我们还要向上做去，得一分就是一分，一寸就是一寸，可以有阿基米德氏发现浮力时叫Eureka的快活。有了这种精神，做人就不会失望。 俗话讲“锯动就有末儿”，文言讲“不积跬步，无以至千里；不积小流，无以成江海”，上进教导我们去做，“殆已”教导我们更有效的去做。二者相称，并不矛盾。 我回中国所见的怪现状，最普通的是“时间不值钱”。中国人吃了饭没有事做，不是打麻雀，便是打“扑克”。有的人走上茶馆，泡了一碗茶，便是一天了。有的人拿一只鸟儿到处逛逛，也是一天了。更可笑的是朋友去看朋友，一坐下便生了根了，再也不肯走。 有个词叫娱乐至死，就是现在这样一个时代。博客的风头被140字的微博改过、图片社交的兴起、短视频的火爆，信息以一种越来越简单容易的方式冲击我们的大脑。和胡适所提到怪现状的行为已经有了很大区别，内核却一脉相承，人们乐于用消耗精力最小的方式去打发时间。这算不上怪现状，只是时代的印记。 第一，因为书是代表人类老祖宗传给我们的智识的遗产，我们接受了这遗产，以此为基础，可以继续发扬光大，更在这基础之上，建立更高深更伟大的智识。人类之所以与别的动物不同，就是因为人有语言文字，可以把智识传给别人，又传至后人，再加以印刷术的发明，许多书报便印了出来。 非常好的解释了为什么要看书，编程界经常提到重复做轮子的事，改进提升不是重复，从零开始才算。如前文中提到的“以有涯逐无涯，殆已”，看书不失为一种捷径，何乐不为呢。 第二点稍复杂，就是为读书而读书。读书不是那么容易的一件事情，不读书不能读书，要能读书才能多读书。好比戴了眼镜，小的可以放大，糊涂的可以看得清楚，远的可以变为近。读书也要戴眼镜。眼镜越好，读书的了解力也越大。 这段话起初我没理解，后来明白了，就像大学里有前置课程一样，看书也是类似。打好了地基才能筑起高楼，这种感觉在理科类书籍比较明显，其实文科类书籍同样存在这个基础，那就是你的人生阅历。有人说长大之后听懂了李宗盛、看懂了鲁迅，便是基础形成了。 第三点，读书可以帮助解决困难，应付环境，供给思想材料。知识是思想材料的来源。 扩充眼界，一目十行的网文也有它积极的价值，在共同怀念一个时代的落幕时，那不再是网文，那是我们的青春。 第一个方子只有一句话：“总得时时寻一两个值得研究的问题！” 第二个方子也只有一句话：“总得多发展一点非职业的兴趣。” 无论如何，大学毕业生离开大学之后，最普遍的危险就是溜回到怠惰和懒散方式的思考和信仰。 与后面的一句话放在一起，学生时代有的人巅峰在高三，有的在本科，离开学校之后知识的获取不再有稳定的渠道，大多数工作在熟悉之后是重复性很强的，如何更新自己的知识体系成了潜在的问题。我第一次感到需要知识更新是在大学里，在开放了个人携带电脑的大二时期，我依靠着更早接触的优势短暂的扮演解惑者的角色，逐渐的我能回答的内容越来越少。 学习是一件苦差事。“值得研究的问题”或是“一点非职业的兴趣”都凭借着明显的价值吸引我们，少有人再去愿意尝试“没用的东西”。即便是值得研究又有兴趣的方向，要收获成果也充满艰辛。我时常教会父母一些数码的东西，聊一些对时政的看法，目的便是保持一种知识的更新。倘若一个人的知识体系被定格了，之后的生活该是多么的难过啊。 古来成大学问的人，几乎没有一个不是善用他的闲暇时间的。特别在这个组织不健全的中国社会，职业不容易适合我们性情，我们要想生活不苦痛或不堕落，只有多方发展业余的兴趣，使我们的精神有所寄托，使我们的剩余精力有所施展。有了这种心爱的顽艺儿，你就做六个钟头的抹桌子工夫也不会感觉烦闷了，因为你知道，抹了六点钟的桌子之后，你可以回家去做你的化学研究，或画完你的大幅山水，或写你的小说戏曲，或继续你的历史考据，或做你的社会改革事业。你有了这种称心如意的活动，生活就不枯寂了，精神也就不会烦闷了。 的确如此，我曾经十一七天假期敲代码做出了辅助工作的一个查询系统。当我对一件事着迷的时候，工作也是乐趣。 第三个方子也只有一句话：“你总得有一点信心。” 生活总要继续，你总得有一点信心。 一个头脑受过训练的人在看一件事是用批判和客观的态度，而且也用适当的智识学问为凭依。他不容许偏见和个人的利益来影响他的判断，和左右他的观点。他一直都是好奇的，但是他绝对不会轻易相信人。他并不仓卒的下结论，也不轻易的附和他人的意见，他宁愿耽搁一段时间，一直等到他有充分的时间来查考事实和证据后，才下结论。 非常好的一段定义，同样是一种我非常推崇的思考态度。现在自媒体兴起、舆论环境空前复杂，如何分辨其真实性呢。我的习惯是看一下知道了就好，特别对于惊奇的震惊的消息保持不轻信的态度。我们开始知道了综艺节目是有剧本的、真人秀也是有剧本的，那么其他渠道呢。信息发布的通道也是操作的工具，言之凿凿尚且能逆转，何况捕风捉影的呢。 在这些文字里，我要读者学得一点科学精神，一点科学态度，一点科学方法。科学精神在于寻求事实，寻求真理。科学态度在于撇开成见，搁起感情，只认得事实，只跟着证据走。科学方法只是“大胆的假设，小心的求证”十个字。没有证据，只可悬而不断；证据不够，只可假设，不可武断；必须等到证实之后，方才奉为定论。 有人求禅有人问道，神秘的文字带来窥破天地的成就感。平实易懂的文字却被忽略一旁，舍近求远啊。 我渐渐明白，世间最可厌恶的事莫如一张生气的脸；世间最下流的事莫如把生气的脸摆给旁人看。这比打骂还难受。 太形象了，我便是看不得别人生气、气氛阴沉的人。到也说不上厌恶、下流，只是那种氛围真的让我难受。 但他们都不明白“文字形式”往往是可以妨碍束缚文学的本质的。“旧皮囊装不得新酒”，是西方的老话。我们也有“工欲善其事，必先利其器”的古话。文字形式是文学的工具；工具不适用，如何能达意表情？ “文字形式是文学的工具”，新的工具才能塑造新的文学，这样的观点很有意思，让我想到了一个相似的例子。在看《费马大定理》的时候，书中提到数学家会通过把一个领域的问题转化到另一个领域，用那个世界的工具去处理，往往能迎刃而解。比方说时域频域的变化，乘除法变为对数的加减。在历史研究中，也有用经济发展水平揭示历史进程的方法。看来问题领域的转化是一种通用的手段，这给了我们一个很大的启发，在遇到难解的局面时，试着用其他环境的语言描述这一问题，也许就能破解了。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/751973659/","link":"/2020/02/index/"},{"title":"《海龟交易法则》书摘记录","text":"因为早就深植各行各业都没有银弹的思维，也就没把本书当做解药去看，有的书确实要在经历过之后再看才能明白。海龟交易法则虽然普遍认为在如今已经失效了，或者说在A股并不适用，这并不妨碍它有有益的部分依然指导后来人。 希望：我当然希望我买了之后，它马上就涨。 恐惧：我再也赔不起了，这一次我得躲得远远的。 贪心：我赚翻了，我要把我的头寸扩大一倍。 绝望：这个交易系统不管用，我一直在赔钱。 通常散户股民的心态正是这样，甚至基金经理也难逃这种情绪化的思维。对于交易系统的怀疑是无可厚非的，相信系统的期望为正没有说的那么容易做到。一旦你处在“失去的十年”期间入市，坚持系统并不能带你走出泥潭。 损失厌恶（loss aversion）：对避免损失有一种强烈的偏好。也就是说，不赔钱远比赚钱更重要。 沉没成本效应（sunk costs effect）：更重视已经花掉的钱，而不是未来可能要花的钱。 处置效应（disposition effect）：早早兑现利润，却让损失持续下去。 结果偏好（outcome bias）：只会根据一个决策的结果来判断它的好坏，而不去考虑决策本身的质量。 近期偏好（recency bias）：更重视近期的数据或经验，忽视早期的数据或经验。 锚定效应（anchoring）：过于依赖（或锚定）容易获得的信息。 潮流效应（bandwagon effect）：盲目相信一件事，只因为其他许多人都相信它。 小数定律（the law of small numbers）：从太少的信息中得出没有依据的结论。 依然是常见的心态，不断反观这些描述有助于我们提升意识。 海龟们从来不去预测市场的动向，而是会寻找市场处于某种特定状态的指示信号。这是一个重要的概念。优秀的交易者不会试着预测市场下一步会怎么样；相反，他们会观察指示信号，判断市场现在正处于什么样的状态中。 市场没法子预测，跟随趋势虽然也是基于历史数据，相比预测明天却要温和的多了。 我们所使用的特殊方法叫作突破法，有时候也被称为唐奇安通道法（Donchian channels），因为是理查德·唐奇安（Richard Donchian）普及了这种通道突破法。这种方法的基本思路就是在市场超越过去特定时期内的最高点时（也就是突破前期价格水平时）买入。我们有两个系统：一个是被里奇和比尔称为系统1的中期系统，它根据过去20天（或者说4个交易周）的价格来决定高点和低点；还有一个时间跨度更长的系统，也就是系统2，它根据过去60天（12个交易周）内的高点和低点来确定突破点。在每个交易日结束后，我们都要为这两个系统重新计算高低突破点。 海龟交易法则提到的突破法。 海龟培训课的所有内容可以归结为以下4个要点： 掌握优势：找到一个期望值为正的交易策略，因为长期来看它能创造正的回报。 管理风险：控制风险，守住阵地，否则即使你有一个期望值为正的系统，你也等不到它创造成果的那一天。 坚定不移：唯有坚定不移地执行你的策略，你才能真正获得系统的正期望值。 简单明了：海龟方法的精髓其实很简单——抓住每一个趋势。你的大部分利润可能就来自两三次成功的交易，所以不要错过任何趋势，否则你全年的努力可能都会化为泡影。这很简单，也很容易理解，只是不容易做到。 第一步就不容易了，特别是海龟法则动辄50%的回撤，谁又能相信自己找到了期望为正的策略。第四点是很对的，向来牛短熊长，在只能做多的A股市场(融券可以做空)，抓住牛市显得更为重要。 喜欢推卸责任的人必败无疑。 无论成败，没人喜欢推卸责任的人。 使用某一种特定策略的人越多，价格差就消失得越快，因为这些交易者本质上都在争夺同样的机会。长此以往，这种效应会毁掉这种策略，因为它会变得越来越无利可图。 这段话意味着海龟策略失效的必然，同样的量化回测平台上的各种神奇策略都面临这一问题。在非确定领域使用量化策略过于冒险，在我看来除了套利操作，量化并不适合股票买卖。 交易的首要目标应该是生存。时间站在你这边。一个期望值为正的系统或方法早晚会给你带来财富，有时候是你做梦也想不到的巨大财富。但这一切有一个前提条件——你必须留在游戏场中。对交易者们来说，死亡有两种形式：一种是痛苦的慢性死亡，足以让交易者们在苦闷和沮丧中放弃交易；另一种是戏剧性的快速死亡，我们称为崩溃。 见证过几次股灾去杠杆，爆仓的新闻雪片一般，留在游戏场中才有机会翻身，背着炸弹宗有可能离场。 那么，有多少幸运儿从那100次随机测试中产生呢？有多少人仅凭好运就击败了我们的最佳系统呢？在100次测试中，有17次的MAR比率高于1.54；在这17次中，有7次的回报率超过了52.2%。最好的一个随机交易者获得了71.4%的回报率、34.5%的最大衰落和2.07的MAR比率。如果你还想靠3年历史记录寻找优秀的交易者，请想想这些数据吧。 一段非常精彩的描述。幸存者偏差可以有效地解释很多问题，正所谓牛市造股神。 参数值的微小变化却引发了交易结果的剧烈变化，这种现象被交易者们称为峭壁（cliff）。峭壁的出现是个很好的信号，这证明你可能已经犯了过度拟合的错误，而且你的实际交易结果可能会与测试中的结果大相径庭。峭壁现象也是我们认为参数最优化有益的原因之一：通过最优化程序，你可以发现峭壁，在开始交易之前就修正这个问题。 我曾经干过过拟合的事，当时不自觉，以为发现了掘金的手段，匆忙入市，毫无胜算。顺便说一句，未来函数有时候真的很隐蔽，如果你的回测收益足够好，那么认真考虑一下吧。 所谓稳健交易，就是用稳健的交易策略来抵御市场波动的风险。要做到这一点，你必须首先接受一个现实：没人可以预知未来，而且任何以历史数据为基础的测试都有相当大的内在偏差。 本书作者的思路还是非常清晰的，在19岁就获得了那样巨大的成功，还能有这般清醒的认识真的不容易。 只要你曾体验过交易者的生活，也就是海龟那样的生活，你的一生都会渗透着交易者的精神。当你经历市场的起落沉浮，发现你的认知偏差，作出相应的思维调整时，你也不自觉地开始在生活中的其他领域做同样的事情。优秀的交易者与其他交易者的区别之一就在于他们不怕与众不同，不怕标新立异，不怕走他们自己的路。 生活会指导工作，工作也会渗透进生活。优秀的交易者养成了优秀的思维习惯，当然也会在生活中应用这样得思维处理问题。 一个好的交易者懂得面对现实。他知道，如果市场已经证明一笔交易是错误的，他要做的不是祈求转机，期盼变化，或是自欺欺人地假装现实已经变化，而是果断地退出。 割肉要果断，前提是策略期望为正。 如果一个市场的合约价值波动性较强，那么这个市场中的合约持有量就少一些；相反，如果一个市场的波动性较弱，这个市场中的头寸就可以大一些。总之，市场的波动性与头寸的规模是相互抵消的。 考虑应用在单一市场的多股持有。 在同一类相互关联的市场中，最好的多头交易都存在于最强势的市场中（这些市场的表现几乎必然强于较弱的同类市场）。同样，最好的空头交易都存在于最弱势的市场中。 同样的，最好的多头交易都存在于最强势的股票中，最好的空头交易都存在于最弱势的股票中。希望如此。 海龟用一个理查德.丹尼斯和比尔.埃克哈特称之为N的概念来表示某个特定市场根本的波动性。 N就是TR（True Range，实际范围）的20日指数移动平均，现在更普遍地称之为ATR。从概念上来看，N表示单个交易日某个特定市场所造成的价格波动的平均范围，它说明了开盘价的缺口。N同样用构成合约基础的点（points）进行度量。 每日实际范围的计算： TR（实际范围）=max(H-L,H-PDC,PDC-L) 式中： H-当日最高价 L-当日最低价 PDC-前个交易日的收盘价 用下面的公式计算N： N=(19×PDN+TR)/20 式中： PDN-前个交易日的N值 TR-当日的实际范围 因为这个公式要用到前个交易日的N值，所以，你必须从实际范围的20日简单平均开始计算初始值。 价值量波动性的调整 确定头寸规模的第一步，是确定用根本的市场价格波动性（用其N值定义）表示的价值量波动性。 这听上去比实际情况更复杂。价值量波动性用下面简单的公式确定： 价值量波动性=N×每点价值量 波动性调整后的头寸单位 海龟按照我们所称的单位（Units）建立头寸。单位按大小排列，使1N代表帐户净值的1%。 因此，特定市场或特定商品的单位可用下面的公式计算： 单位=帐户的1%/市场价值量波动性 或 单位=帐户的1%/(N×每点价值量) N值和头寸单位的计算值得借鉴，海龟的加仓和退出策略太可怕了。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/754022082/","link":"/2020/03/index/"},{"title":"从《希特勒回来了》想到的","text":"豆瓣日记恢复了，以下是昨天写的搬运过来。 之前一直刻意避免在文章中出现时事的内容，并非不关注没想法，仅仅是不想在回看的时候有一个旧文的先入为主的观念。豆瓣的日记功能暂停了，搜了下原因是《一个武汉女生的真实日记》，文字平实没有任何煽动渲染，豆瓣这次的反应让我一如既往的失望。ps：简书粗暴的机器人过滤更让我失望。 疫情期间在家的时间多了起来，从“想看”的列表最底端开始，终于看到了这样一部标签类型是喜剧的《希特勒回来了》。 德国人一直在反思和小心的注视着当年和现在的纳粹思潮。片中在楼顶时希特勒对男主说的话很值得思考，结尾在这里也是很好的方式。一方面是纳粹的思想依然能够获得支持(真正的拥护者，而不是合照的那些)，一方面是德国在遭遇现有问题困境时去寻求解决的办法。一体两面的看，那种思想既是认为煽动的也是深植德国人乃至我们内心深处的；那种思想既产生了人类悲剧的后果，或许也存在成为一种良药的可能性。在这里并不深究纳粹行为的表现，而是对于任何一种能够获得人民支持(希特勒是民主选取的结果)同时又隐藏在我们内心的世界观，极大可能的有某一些角度存在着它的合理性。影片是德国人对于国王的思考，更是对于当下的探讨。 限于字数，我在豆瓣写下了上述想法，在这里补充一些。 首先就电影而言，一部影片呈现给观众的至少有电影性、思想性、启发性三方面的内容。电影性更多的关注色彩、灯光、音乐、拍摄技法、演员表达、细节设置等电影制作上的内容。思想性集中于电影所展现故事想表达的内容，导演想要体现的想法，是一种和观众的对话。启发性表现出一种延展，在了解了导演所抒发的情绪之后，观众自己能够想到的。这三方面是主观感受逐渐增强的，评价差异也逐渐显现。 《希特勒回来了》在我看来是一部启发性&gt;思想性&gt;电影性的作品，无论是豆瓣还是imdb对它的评分都不算高，正是其电影性不足的体现。影片要抓人，特别要平衡好节奏和爆点。现在观众普遍阅影无算，被猜到情节发展并不可耻。能做到依靠情绪积累，在一个点引爆，在一个点戛然而止，就依然能获得认可。本片显然没有那么抓人。 你无法摆脱我，我是你的一部分，来自你们所有人。一切并非都是负面的。 ——《希特勒回来了》 德国人对于二战的不断反思，保证了本片在思想性上的基本盘。“你无法摆脱我，我是你的一部分，来自你们所有人。一切并非都是负面的。”，这样精彩的台词甚至可以直接作为中心思想写在答题卡上。逻辑辩证法是每一个历经义务教育的人都曾接触过的，我们学过但是应用过么。二元对立的非黑即白的判定是容易的，也是懒惰的。特别是对待已经被盖棺定论的问题，更要保持谨慎的思考。网络上五毛和美分的简单标签化、阴谋论和翻案论的轻易结论，其实都是二元思维。 这里暂不赘述，还是回到影片的启发性，对于历史的铭记很重要，对于历史的思考也很重要。有无数演绎忘不掉仇恨和忘却了仇恨的影视作品，当然在我的思维体系中这两种是没有对错只有逻辑是否合理的。简单的记住一个事件的结论往往是以偏概全的，要了解它的起因、发生的经过、为什么会导致最终的结果，这才是一个完整的逻辑链条。在了解了其发生的逻辑合理性之后，注意这并不代表事件本身在当下社会的好坏判断，我们才能心平气和的思考其中值得借鉴的地方、发现值得警惕的地方。所谓“取其精华，去其糟粕”，八个字说来容易，做到却很难。 看过了《一个武汉女生的真实日记》之后，情感上很那平复，不自觉的把自身带入那个场景，想象着那是自己的亲人。每天看着确诊、死亡、治愈数字的变化，容易变得麻木，想到那背后都是一个个真实的人、真是的家庭就觉得后脊发凉。愿疫情早日平息，病者能够康复。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/751314811/","link":"/2020/02/index/"},{"title":"《费马大定理》书摘记录","text":"已经过去了一个多月，回想起读这本书时的激动与入迷，觉得还是补记一下当时的书摘。 完美！这一本书打破了我对于外国人写书和理科类书籍的刻板偏见，也要感谢译者的绝妙翻译。怀尔斯面对费马大定理的那种决心、怀疑、局促和完成后的失落，是每一个为一个不确定目标追求过、付出过的人都经历过的。如同译者在最后写到的，我们的心情也随着故事的进展而起伏跌宕，在我看到怀尔斯第一次触到了解决费马大定理的时候，内心的激动难以抑制。把一个完全数学的故事描绘的如此引人入胜，由衷感叹这位科学作家的文字功底。内容与表达并重很困难，却很有趣。 毕达哥拉斯定理为我们提供了一个方程，它对一切直角三角形都成立，因而它也定义了直角三角形本身。接着，直角定义垂直，即竖直与水平的关系；最后定义我们熟悉的宇宙的三维之间的关系。数学（利用直角）定义了我们生活着的空间的结构。 曾经幻想过如果世界上的各种现代设备消失了，人类能不能在短时间内重新发展起来。我们站在了太高的巨人肩上，高的已经看不到地面在哪里了。数学的逻辑清晰给了我们很好地阶梯，可以放心的从地面攀爬，这个阶梯牢不可破。 毕达哥拉斯用事实证明，与任何别的学科相比，数学远不是一门主观的学科。他的信徒们并不需要他们的大师来裁决一个特定的理论的正确与否，理论的正确性不依赖于人的看法。相反，数学逻辑的解释已经成为真理的仲裁者。这是毕达哥拉斯学派对文明的最伟大的贡献——一个获得真理的方法，它不会像人类判断那样难免出错。 与实验科学相比，数学的严谨是近乎苛刻的，也正是这样得严格给了我们前进的勇气。 数学不是沿着清理干净的公路谨慎行进的，而是进入一个陌生荒原的旅行，在那里探险者往往会迷失方向。撰史者应该注意这样的严酷事实：绘就的是地图，而真正的探险者却已消失在别处。 ——W. S. 安格林 从小学到大学，毕业后依然发现知之甚少，有着上不完的课。一切知识的递进似乎顺理成章，却容易忽略了先驱者们披荆斩棘开辟出一段路的艰辛。没有人知道方向是不是正确，每一个勇敢的试错者都为后来人降低了一点难度。地图绘就了，在或笔直或蜿蜒的道路之外，那些拨开了迷雾却没有道路的区域填充的是探险者的足迹。 创建数学是一个充满痛苦且极为神秘的历程。通常证明的目标是清楚的，但是道路却隐没在浓雾之中。数学家们踌躇不决地计算着，担心着每一步都有可能使论证朝着完全错误的方向进行。此外，还担忧根本没有路存在。数学家可能会相信某个命题是对的，并且花费几年的工夫去证明它确实是对的，可是它实际上完全是错的。于是，在效果上，这个数学家只是一直在企图证明不可能的事。 精彩的描述！像一个淘金者，金矿的传闻让人着迷，而每一筐沙子都让他沮丧，痛苦、怀疑、持续痛苦，在结果证明之前，每一个数学家都会面临淘金者的情形。 换言之，在扭结不变量被发现以前，不可能证明易散结与方结、反手结或甚至根本没有结的环之间是根本不同的。在许多别的数学证明中，不变量的想法也是重要的。 非常有趣而且有用的启示，不变量作为一种新的武器出现在我面前，用法尚需研究。 众多逻辑学家参与了这个缓慢而棘手的只使用个数最少的公理来重建这座无比复杂的数学知识大厦的过程。想法是完全按照最严格的逻辑标准对数学家认为他们已经知道的东西进行整顿。 恐怕在没有第二个领域能像数学一样从零做起，按照逻辑的要求进行推演，直至建立大厦了。哪怕只掌握一点点这样严谨的思维方法，都会在生活中、在工作中产生巨大的推动。普遍工作中，人为因素已经多到了即便有流程都不知道如何操作的程度，太多的变量和被忽略的细节致使每一次输出都是未知的。 解答某个数学问题的欲望多半是出于好奇，而回报则是因解决了难题而获得的单纯而又巨大的满足感。 数学是数学家的游戏。训练是专业选手的工作。即使过程艰辛，揭开面纱那一刻依然有着巨大的快乐。 一个高超的问题解答者必须具备两种不协调的素质——永不安分的想象和极具耐心的执拗。 ——霍华德·W. 伊夫斯 大胆假设，小心求证。越简单的话越难践行。 怀尔斯描述了他怎样试图完成证明的最后一步：“5月末的一个早晨，内达和孩子们一起出去了，我坐在书桌旁思考着这剩下的一族椭圆方程。我随意地看一下巴里·梅休尔的一篇论文，恰好其中有一句话引起了我的注意。它提到一个19世纪的构造，我突然意识到我应该能够使用这个结构来使科利瓦金-弗莱切方法也适用于这最后的一族椭圆方程。我一直工作到下午，忘记了下去吃午饭。到了大约下午三四点钟的时候，我真正地确信这将解决最后剩下的问题。当时已到饮茶休息的时候，我走下楼去，内达非常惊奇我来得这么迟。然后我告诉她——我已经解决了费马大定理。” 平静而激动人心一刻的描述，对于本书的喜爱除了数学上一些大开眼界的内容，更多的是作者绝妙的文笔和译者精确的翻译。虽然后面出现了波折，我却一直认为这时就是伟大的一刻。 怀尔斯在牛顿研究所演讲后不到6个月，他的证明已破绽百出。多年的秘密演算给他带来的愉悦、激情和希望被烦恼和失望替代。 在我过去写代码的时候，未解决一个小bug，最终探索出一个巨大的逻辑漏洞，便是这样的心情——烦恼和失望。全身心的投入并不会使我们感到痛苦，身体的疲惫在精神的多巴胺下不值一提，而那种致命的错误则会戳破这个美好的泡沫，放弃的念头也会浮现。 数学证明不仅回答了问题，它还使人们对为什么答案应该如此有所理解。把问题送进一个黑匣子然后从另一端收到一个答案，这增加了知识但没有增进理解力。 数学是一种严格的逻辑思维。有句话说“知道了很多道理，依然过不好这一生”，这就是增进了知识但没有增进理解的现实版本。写代码时有个词叫重复造轮子，造轮子的理由有很多，其中一条一定是增进理解。 解决这个问题之后，肯定有一种失落感，但同时也有一种无比的轻松感。 又是一个精彩而精确的描述。如果你没有这种感受，既失落又轻松的感受，要么是那个解决了的问题还不够格，要么是你还不够投入。看一部书、一个系列电影、一个游戏通关其实都会有类似的感觉。问题本身已经足够沉重，压得你透不过气，解决之后的轻松感的收获的快乐是可以想见的。为什么会失落呢？问题被解决了，它就告别了你，你所有的投入、阶段的快乐、最后的喜悦都成为往事，然而前路漫漫，未来依然迷雾重重，莫名的失落感不由得涌上心头。 Frodo和Sam结束了最后的旅程，Sam回归霍比屯，Frodo乘船远去。Sam会如何回忆这一段故事，会怀念魔戒远征队并肩战斗的情景，怀念和Frodo穿越魔多的惊险，怀念为救同伴斩杀兽人的英勇。眼前是美好的场景，妻子孩子欢聚在一起，在这一刻他是否会有一丝失落呢。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/754405782/","link":"/2020/03/index/"},{"title":"关于豆瓣评分","text":"曾经在2013年3月写过一次关于豆瓣评分的想法，以下原文权作记录。 豆瓣评分采取的是5星制，最高分为10分，最低分未知。其实倒也不是真的不知道，按照直观感受，5星将10分划分为两分一档，虽然最低分不会低于2分，但是仍然以0分为基准，但是这种代换会带来问题。 如果真的把10分划分五份，则为 0~2、2~4、4~6、6~8、8~10，这里面暂不考虑边界问题，这样划分是合理的，而且这样是可以出现低于2分的情况的。豆瓣的做法应该是直接取值2、4、6、8、10，所以实际上是5星划分了10-2，也就是8分的评分区间。那么每一档为1.6分，划分变为2~3.6、3.6~5.2、5.2~6.8、6.8~8.4、8.4~10.0。看到这组数字各位有什么感觉么，相信常用豆瓣记录的人是有似曾相识的感觉的。 说说我的打分习惯，和豆瓣对于5星的描述还是有一些出入的。因为主要记录的是音乐和电影，更多是直观感受，激情打分也是有的。觉得无感的，通俗讲一般的我打3星；感觉还行，却又不臻完美的打4星；被明显打动了的，则个主要是指电影，音乐则是专辑中有四五首非常欣赏的歌，这样的打5星。1星和2星我是很少打的，毕竟都是辛辛苦苦弄出来的作品，没有功劳也有苦劳，所以比如特别觉得不好的才会打2星；我打出的1星基本上全是个人好恶和头脑发热的体现，当然我也不会去改评分，评分就是简单地主观感受最为真实。 在我打分时也有一些模棱两可的情况出现，这个就和具体的10分值分数挂钩了。一般来说纠结主要是在3星4星间出现，我往往比较下我设想的十分制分数和当前分数，当前的低了就打高一颗星，反之亦然。有时打5星也是处于这种考虑，不过很少。我对于5星是有自己的划分的，8.5+的为5星，7+的4星，5.5+的3星，以下不再区分。可以看出我基本上以1.5分为一档，和豆瓣实际的1.6差不多。对于10分制，我们都有固化得观念，那就是6分是及格线，而不是一半的5分或者更低。我的评分3星限制在5.5+，其实已经妥协了豆瓣的做法，因为我对于三星的第一反应就是6分，低于6分的就不是3星，可实际上这样行不通。5.5已经比5.2要高，更高于直接均分的4~6，这种差别就在于我们已经根深蒂固的60分概念，3星不是中间，而是及格甚至是基准之上。 打分这件事不容易做到完全客观。我们打分甚至比跳水、体操的打分还要更为偏颇，因为我们的打分毫无标准，纯粹的个人行为，混合着个人的习惯于性格。我特意观察过一些人的打分历史，因为一些我打5星的条目却只得到他的3星甚至更低，我非常好奇他们评分的角度。在浏览他们评分历史的过程中，我发现不能够简单地将他们笼统的归为一类，他们的行为相当的不同。最明显的两类，一种是很少打高分，似乎只有2、3、4三个备选；另一种是很常规化的评分，只是我看到那个条目与我评分差别较大，这个属于正常的评分行为。 时隔七年，我的打分习惯并没有什么改变，除了我会在二次打分时修改评分和短评。 关于评分，它包含两个因素，打分的人群和评分的计算方法。评分计算更偏向数学问题，这里不班门弄斧，还是来聊一下打分人群。首先预置如下几个前提： 前提1：首先:假设是豆瓣或者其他打分网站没有人为调整分值，即只根据用户评分和预置的算法进行计算，而不会去手动修改。 前提2：艺术作品的评分是一种见仁见智的事情，不同于竞速比赛成绩的一目了然，艺术作品不具备客观评价的基础，不同的受众有不同的看法。 前提3：用户的评分是一种主观行为，既是一种个人行为也是一种群体行为。 前提4：评价意见艺术作品，需要参照时间背景，可参照的背景包括作品形成时期和用户评价时期。 能够认可以上四点作为公共基础的，大致也就能了解我对于评分的看法。 对于一部艺术作品（包括电影、电视剧、音乐、图书等），不存在一把能测量它们的客观价值的尺子。每一位用户依据他所处的时代、他的世界观价值观人生观的局限性，对这一作品进行评价。评价行为不仅仅是个人观感的结果，同时受到群体影响，反身性原理同样适用于用户评分行为。 豆瓣、知乎、微博、虎扑等等，每一个平台形成一个个虚拟的阵营，互相呈现出或鄙视或歧视的关系。如同常见的地图炮和一个省中各城市眼中的对方一样，我现在还不了解应该怎样称呼这一种心理学现象，大意是通过攻讦一方以获得所处团体的认同感和优越感。那么对于豆瓣的标签早期是“文青”，后来流量上去了就增加了“水军泛滥”。在这个定义下，普遍观点是豆瓣对于文艺片、难懂的片子评分是偏高的，曲高和寡反向应用，因为和寡所以曲高，进而这个人群也就跟着高了起来。作为豆瓣、知乎、虎扑三平台的前期用户（不敢称早期，在平台火爆之前可以算前期用户吧），我并没有在打开某一个app时变得更博学一点或更幼稚一些，虚拟阵营的对立存在着极大的用户交叉性。在我看来，豆瓣上的评分就是那一个群体对于作品的看法，“本来无一物，何处惹尘埃”，一件没法客观评价的事物又何来评分高低呢。 然而我们还是会分辨作品的高低，会感觉评分的错判啊。这就是前提4谈到的内容，由于局限性的客观存在（局限性是中性词），由于知识的不完备性，评价的主观性和差异性成为必然。每一个时代、每一个时期、每一种主流思想下，都会有一种影响大多数人群的审美价值，这种价值像一个期望值，平衡者不同的波动。因为反身性的存在，潜在的价值不一定能回归，最终的评价结果是难以预测的。黑粉之间的拉锯、水军和保卫者之间的争夺、算法的及时调整，都让最后平稳了的评分变得模糊不可测。但那就是这个时代，这一群人对于作品的看法，体现了“局部的客观性”。 豆瓣的5颗星评分，好处是足够简单，打分时没有太大纠结，缺点是分档过大。就像音量增减不是线性的一样，艺术作品评分恐怕也是一样。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/751845629/","link":"/2020/02/index/"},{"title":"写在重刷魔戒三部曲之后","text":"先记录下三部曲(指环王1：护戒使者/指环王2：双塔奇兵/指环王3：王者无敌)中最触动我的一段台词。在Frodo困惑无措的时候，是Sam鼓舞了他。这段话也将在我每一次遇到困难时鼓舞着我。 I know. It’s all wrong. By rights, we shouldn’t even be here. But we are. It’s like in the great stories, Mr. Frodo. The ones that really mattered. Full of darkness and danger they were. And sometimes you didn’t want to know the end. … because how could the end be happy? How could the world go back to the way it was… … when so much bad had happened? But in the end, It’s only a passing thing this shadow. Even darkness must pass. A new day will come. And when the sun shines, it will shine out the clearer. Those were the stories that stayed with you… … that meant something. Even if you were too small to understand why. But I think, Mr. Frodo, I do understand. I know now. Folk in those stories… …had lots of chances of turning back, only they didn’t. They kept going… …because they were holding on to something.&quot; “What are we holding on to, Sam?” &quot;That there’s some good in this world, Mr. Frodo. And it’s worth fighting for. 太阳终将升起，黎明前却是难捱的黑暗，久久不退看不到光亮。故事之所以成为故事，便是他们一直向前，在无数次放弃、回头的机会前，他们依然继续前进。 前段时间陆续看完了哈利波特和指环王，和原来的看法有了很大变化。之前从来没有看过哈利波特系列的我，一直认为这个作品是给小孩子看的魔法童话故事，而指环王系列是为成年人构筑的魔幻战争史诗。谈一下观影后的感受吧，两个系列有着完全不同的精神内核，或许是女性作家与男性作家的区别。哈利波特世界的主旨是家庭和爱，而不是战斗；指环王三部曲的内核是坚定不移的信念，恰恰也不是战斗。 两部电影有许多相似的设置，但也仅限于此。哈利波特世界的魔法强大的多，当然那我一直认为手挥魔法棒影响了电影效果的展现，好在这并不是终点，不然也很难接受那样的哈利能够击败众人不敢直呼其名的伏地魔了。指环王世界是低魔的，无论是战斗技能点满的甘道夫，还是在熟人进攻面前举足无措的萨鲁曼，魔法不是这个世界的主旋律。如同我喜欢的诺兰蝙蝠侠系列一样，指皇王里面的战斗就是单纯的肉搏，与种族无关。兽人会被霍比特人一剑结果性命，精灵也不能依赖魔法重生。我非常欣赏这样的设定，他把片中多方势力放在一个相似的水平下较量。重新拥有了勇气的人类不再懦弱、坚定信念的霍比特人能够身背重任、隐世脱俗的精灵投入战争中直面死亡、恐怖的兽人只是形象可怖、白袍巫师以魔杖做长枪、魔君索伦会被利剑削断手指。没有修仙没有玄幻，这样干脆直接的世界就是我们现实的世界啊，每一个种族每一个角色都投射着我们自己的影子。我们会逃避、会怯懦、会渴望被认可、会迷失自己、会依靠同伴、会给鼓舞、会重拾勇气、会偏向虎山行、会再见光明。没有童话故事的距离感，没有虚幻的美好，我更喜欢这样表现我们自己的作品。 试想一下Frodo和Sam在踏上只属于他们那一段旅程时的心情。魔戒远征队只剩下两个身材矮小的霍比特人，旁边是狡诈的咕噜，目的地是魔君老巢的末日火山，途中要穿越荒无人烟、兽人遍地的区域。干粮没有了、水没有了、同伴被自己赶走、魔戒越来越重，放弃从来没有这么容易过，坚持下去又真的能成功么。刚铎是不是已经沦陷了，末日火山融化魔戒的说法是不是真的，能不能顺利到达那里、史麦戈值得可怜，咕噜却时刻想要抢回魔戒。Frodo几乎从来没有表达过这些疑问，从他忘了梅里和皮聘一眼后转身独自划船离去，他就知道这是他一个人的旅程；Sam也从憧憬家乡的美好慢慢的，说出我们可能回不去了。这是一个单程的旅行，一个在战争世界最被忽略的种族，肩负拯救世界的重任，舍生赴死的勇气和霍比特人唯有的坚韧毅力支撑着Frodo和Sam走完最后的一段路。 Frodo被诱惑了。个人认为最后放弃摧毁魔戒、与咕噜争夺魔戒是非常棒的一个细节。影片一直在铺垫魔戒的诱惑力， 埃西铎、比尔博、精灵女王、 博罗米尔、阿拉贡、咕噜，有的接受了考验有的深陷其中。如果把Frodo塑造成一个天选之子，一个伟光正的人物无疑削弱了影片的感染力。Frodo最后的被诱惑恰恰体现了这一任务的困难，人类完成不了、巫师不能触碰、精灵矮人同样完成不了，即便是心志坚定的霍比特人也在最后一刻几乎迷惑。如果没有咕噜，Sam很可能会去完成最后的任务，两个人同时坠落那样的结局想象一下都觉得心酸，我们希望给负重前行的人们一个更好的归宿。 曾经我以为指环王系列是战争的史诗，在这一次看过之后忽然觉得这是一个成年人的童话，带给人们美好的信念，坚持下去终会胜利。 回到那个充满魔法的世界，看过哈利波特七部曲的八部电影之后，我几乎立刻就像重看一遍，这是一个伟大的系列，我要收回从前肤浅的论断。影片和观众一起成长，三人组给了观众最初的美好。在那些观众渐渐长大面对到世界的残酷之时，主角也遭受到了最危险的挑战，影片一步步渐黑的色彩展现了这一背景。不是灰太狼七部曲、也不是猫和老鼠续集，一部在成长的作品没有被局限在小孩子的魔法童话世界，当然它从来也不是，那是我的偏见。 已经记不清哈利波特是怎么打败伏地魔的了，怎么回忆也想不起。相对于那威斩蛇的场景清晰可见，或许在心里很难接受哈利波特单挑大boss胜利的设计。19年后的那个片段，一下子就回忆起第一部时三人组的初见，美好才是主题啊。我相信伟大作品中的战斗场面多是手段，而不会喧宾夺主，指环王是这样，哈利波特系列也是这样，我们热爱的金庸小说也是这样。武侠是一种叙事方式，却不是事情本身，所以到了笑傲江湖，可以无招胜有招；到了鹿鼎记，主角干脆不再是武林高手了。想起当年语文课上讲解小桔灯，第一次学到了象征的写作方法。很多年后才真的理解，艺术作品中的每一个符号设置都有他对应的象征意义。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/754377681/","link":"/2020/03/index/"},{"title":"在vscode中使用pipenv环境运行jupyter","text":"每次配置都要重新搜索一遍，这回记录一下配置过程。 0. 准备 python、pipenv、vscode均安装完成，pipenv的环境变量已配置好，可以直接呼出。 在公共环境下安装jupyter，确保可以正常运行 1. 查看Pipenv的位置 先激活Pipenv环境 pipenv shell 获取当前虚拟环境的位置 pipenv --venv 2. 打开setting.json配置文件 Ctrl+Shift+P，输入settings，选择Open Settings(JSON) 将之前得到的Pipenv环境路径添加进去 &quot;python.venvPath&quot;: &quot;C:\\\\Users\\\\Administrator\\\\.virtualenvs\\\\test_pipenv_jupyter-yZGS62vC&quot; 如果存在多个虚拟环境，用逗号分隔 3. 重启vscode 选择对应环境 4. 安装ipykernel 替换pipenv源为清华源，编辑pipfile文件的url字段 国内其他源地址 阿里云：http://mirrors.aliyun.com/pypi/simple/ 豆瓣：http://pypi.douban.com/simple/ 清华大学：https://pypi.tuna.tsinghua.edu.cn/simple/ 中国科学技术大学：https://pypi.mirrors.ustc.edu.cn/simple/ 启动pipenv环境，安装ipykernel pipenv install ipykernel 5. 测试jupyter文件 打开一个新建的.ipynb文件会自动切换成下图显示效果，右上角提示环境尚未启动。 查看一下sys.path，可以发现引用环境已经挂载到了虚拟环境，右上角也提示了之前选择的环境名称。 6. 最后 截止到当前版本，pywin32(v225 ~ v227)的坑已经被填平了，直接按照上述步骤配置即可正常使用。 其实也可以直接在pipenv环境下直接安装jupyter，只不过考虑安装包大小和安装时间，以及在非虚拟环境下也会用到jupyter进行工作，最后选择了这种折中的方式。在满足步骤0中的准备条件下，可以通过pipenv的配置文件实现快速重建环境。 7. 参考引用 https://www.cnblogs.com/sikongji-yeshan/p/10492021.html https://blog.csdn.net/jpch89/article/details/81952416 https://jakevdp.github.io/blog/2017/12/05/installing-python-packages-from-jupyter/ https://stackoverflow.com/questions/47295871/is-there-a-way-to-use-pipenv-with-jupyter-notebook https://github.com/jupyter/notebook/issues/4909 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/750959014/","link":"/2020/02/index/"},{"title":"旬回豆瓣","text":"回归豆瓣 其实从来也没有类开过豆瓣，从最初注册的2008年算起恰好一旬，当我想要开始写文字的时候最先想到的，还是豆瓣。对这里的感情一直在变化，出于记录个人读书观影听音乐点滴的目的，我非常幸运和感谢有这么一个持续十余年运营的地方。豆瓣几经改版，产品线也有过很多尝试，对阿尔法城的期待和最后下线时的怀念，对豆瓣api的希望、自己写出了C#版本的接口却不得不面对没有官方人员再去维护的api的事实，对豆瓣评论字体太小、排版丑陋而又十几年如一日坚持不变的吐槽。然而，在我选择一个写东西的平台时，看过了世界最终还是回到豆瓣，不变的是豆瓣一直是我一个希望的寄托，我一直希望豆瓣会更好。 为什么要开始写字呢？如果在夜晚脑袋中思路高速运转的时候，有一台记录仪可以直接转换成文字，我是不会在白天边会议思绪边在这里敲字的。即便在我不多的生活经历中依然有过数次对于人生、对于社会、对于哲学的思考，当我们走过这一生能留下的是什么，在回首往事时能想起什么。文字和照片一样，这就是我们来过的印记。 我不是一个爱写日记的人。初中时老师要求写周记一度让我很痛苦，本就不擅写做的我又想不到什么可记录的事情自然无法下笔。后来到了大学，莫名的渐渐喜欢上了记录情绪，也许几天也许几个月，慢慢的也写满了整个本子。行文还是那么没长进，却不妨碍我乐在其中，独自在自习室、在书桌前、在橙黄的灯光下写着见闻感触、理解与思考的感觉，如同涓涓细流绵延而顺滑。 看奇葩说有感 最近和媳妇一起在看奇葩说第六季，几乎每一道辩题我俩选择的方向都不一致，我们为啥要看一档可能导致家庭不和睦的综艺啊，所以我非常平和而郑重的表达了自己的看法。 要怎样才能说服别人呢，在我看来有两个方法，核心都是以高打低。一种情形是领导安排工作，就算下属不以为然大多也会依令执行，君君臣臣父父子子就是这一类；另一种是高屋建瓴降维打击，黄执中管用的开头“这道题说的是…么，不是”，然后从另一个层次去论述，这是一个行之有效难以辩驳的思路。假若双方在同一量级、说的内容也在同一框架，往往各执一词、无法达成统一的结果。网上传过的一短话就是，不要和xx争论，他会把你拉到他的水平，然后用丰富的经验打败你。这就是讲道理才有机会说服双方，不讲理要么没有终点要么劣币驱逐良币，最终以“高尚者”的妥协收尾。“高尚是高尚者的墓志铭/卑鄙是卑鄙者的通行证”便是最好的总结。 第一，辩题不是问题。这是将不同观点的争论限制在一个盒子中的前提，综艺节目也好、专业辩论比赛也好，辩题终归是认为设置的比赛，它不是生活中真实的问题、不是非黑即白的是非问题。第二，要接受每一道辩题都是可辩的。选手们的持方是抽签的，无论本人怎么想也要绞尽脑汁准备持方的发言材料。好的辩手是在正反方都能发挥的，我们没有那么高的水平，但至少要认可这个公共基础，一道辩题的双方都是可以找到出发点去说服观众，而不是一个在时政节目讨论的社会热点，要找出一个可行的方案。 看奇葩说时我们在看什么。比赛进行到半决赛决赛，选手们频频为对手鼓掌，这也是这个节目的意义。独立思考的态度、语言表达的技巧、观点角度的挖掘、不同思路的包容，这才是思辨的乐趣。马东说过奇葩说不是一个寻求真理的节目，这是一个很好的指引，不正确的看待节目传达的目的和将节目与现实混为一谈一样危险。 奇葩说第六季结束了，陈铭之后我最喜欢的辩手詹青云不出意外的获得了bbking，理性而有趣、恰到好处的语气和节奏、内容的充实和角度的精确，两位辩手具备相似的特质，胜出的理所当然。有千人千面的哈姆雷特，同样也有千人千面的奇葩说，以上便是我看到的。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/749706785/","link":"/2020/01/index/"},{"title":"看书时我们到底在看什么","text":"新的一年虽然没有郑重的立下什么flag，行动上还是默默地擦了擦kindle上的灰尘。再看到显示屏上那些数字的书名、阅历统计上许久未动的数字，不禁在想，看过了这许多书，除了依靠豆瓣记录的评星和短评，那些书到底在讲什么，用有涯的生命换来的无涯却有限的阅读时光究竟能带给我什么。 我最初开始看书是在高一，书桌间传阅的三联版金庸实在太过吸引人，新同学间聊天时展露的广博知识也击破了自己还不错的肤浅认知。即便武侠小说不在彼时的推荐书目之列，入门找个有兴趣的总还不错吧。到了大学，有了图书馆的加持，每天午睡前拿起本书翻上几页，看的无趣边睡得快些，看上了瘾下午就要打瞌睡了。离开校园之后，不再有那样惬意而放肆的时段了，玩游戏都只想玩速战速决的老游戏，看书成了奢侈的享受。当初抱着辞海一样大本的诛仙和昆仑的时光再也回不来了，不是网文不够优秀，而且再没有耐性读那些动辄百万的文字。假想着看过之后空洞的收获，几乎是彻底的放弃了这一类书。 Kindle的优秀在于不读书的人也会想买，多看早期的努力无疑将像我一样处在读与不读边缘的人拉进了这个圈子。以前我差不多只看小说，茅盾文学奖的大红皮也还是小说，多看的限免客观上打破了这个局限。虽然也会先看下豆瓣上的评分，但是对于体裁我不已再那么挑剔。 社科类书籍之于小说最大的特点就是容易遗忘。小说是一条线，记住了几个点就能连得起来；社科书籍是天上的星星，记住了明亮的也想不起暗淡的。小学时作文类型的重要组成部分就是读后感、观后感、游记之类的，当时年幼没感想也写不出，现在才知道这应用文原来要这么用。看书时我们到底在看什么，就是那一刻想到的，写下来也就留住了。留住了思考，也就留住了时间。 看书的选择和收获是见仁见智的，如同这世上其他的永恒之问一样，这种问题从来就没有唯一的答案。就我当下的心性而言，看书总想着能得到些什么，或许有些功利心，但只要是兴趣所在又乐在其中也就没什么负担了。最近看了两本罗振宇和奥格威的书，即便我不认同罗振宇的某些观点，即便我压根就不懂广告行业，这都不妨碍从其中获得感悟。我喜欢这种思维上收获，从二元认知到多维度的思考，这是成长的体现。古话讲海纳百川，我父亲曾经教导我融入而不混同。接纳包容多方的思想，从不同的角度看待问题、看待世界，保持独立而不特立的思考，不否定、不盲从，这是我时下认同而追求的方向。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/750100731/","link":"/2020/01/index/"}],"tags":[{"name":"建站","slug":"建站","link":"/tags/%E5%BB%BA%E7%AB%99/"},{"name":"cath.dnip.net","slug":"cath-dnip-net","link":"/tags/cath-dnip-net/"},{"name":"豆瓣","slug":"豆瓣","link":"/tags/%E8%B1%86%E7%93%A3/"},{"name":"C#","slug":"C","link":"/tags/C/"},{"name":"doubanOAuth","slug":"doubanOAuth","link":"/tags/doubanOAuth/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"记录","slug":"记录","link":"/tags/%E8%AE%B0%E5%BD%95/"},{"name":"新浪博客","slug":"新浪博客","link":"/tags/%E6%96%B0%E6%B5%AA%E5%8D%9A%E5%AE%A2/"},{"name":"黑镜","slug":"黑镜","link":"/tags/%E9%BB%91%E9%95%9C/"},{"name":"javascript","slug":"javascript","link":"/tags/javascript/"},{"name":"豆瓣日记","slug":"豆瓣日记","link":"/tags/%E8%B1%86%E7%93%A3%E6%97%A5%E8%AE%B0/"},{"name":"vscode","slug":"vscode","link":"/tags/vscode/"},{"name":"jupyter","slug":"jupyter","link":"/tags/jupyter/"},{"name":"奇葩说","slug":"奇葩说","link":"/tags/%E5%A5%87%E8%91%A9%E8%AF%B4/"}],"categories":[{"name":"记录","slug":"记录","link":"/categories/%E8%AE%B0%E5%BD%95/"},{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"},{"name":"旧文","slug":"旧文","link":"/categories/%E6%97%A7%E6%96%87/"},{"name":"文档","slug":"文档","link":"/categories/%E6%96%87%E6%A1%A3/"},{"name":"电影","slug":"电影","link":"/categories/%E7%94%B5%E5%BD%B1/"},{"name":"代码","slug":"代码","link":"/categories/%E4%BB%A3%E7%A0%81/"},{"name":"观点","slug":"观点","link":"/categories/%E8%A7%82%E7%82%B9/"},{"name":"阅读","slug":"阅读","link":"/categories/%E9%98%85%E8%AF%BB/"}],"pages":[]}