{"pages":[],"posts":[{"title":"Markdown 参考文档","text":"最大标题 第二大标题 最小标题 这是粗体文本 这是斜体文本 这是错误文本 此文本 非常 重要 所有这些文本都很重要 Text that is not a quote Text that is a quote 使用 git status 列出尚未提交的所有新文件或已修改文件。 一些基本的 Git 命令为： 123git statusgit addgit commit 本站点是使用 GitHub Pages 构建的。 George Washington John Adams Thomas Jefferson James Madison James Monroe John Quincy Adams 第一个列表项 第一个嵌套列表项 第二个嵌套列表项 [x] #739 [ ] https://github.com/octo-org/octo-repo/issues/740 [ ] Add delight to the experience when all tasks are complete :tada: First Header Second Header Content Cell Content Cell Content Cell Content Cell Command Description git status List all new or modified files git diff Show file differences that haven’t been staged Left-aligned Center-aligned Right-aligned git status git status git status git diff git diff git diff Here is a simple flow chart: 12345graph TD; A--&gt;B; A--&gt;C; B--&gt;D; C--&gt;D;","link":"/2022/02/Markdown%20%E5%8F%82%E8%80%83%E6%96%87%E6%A1%A3/"},{"title":"Hello Cath","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick Start Create a new post 1$ hexo new &quot;My New Post&quot; More info: Writing Run server 1$ hexo server More info: Server Generate static files 1$ hexo generate More info: Generating Deploy to remote sites 1$ hexo deploy More info: Deployment","link":"/2022/02/hello-world/"},{"title":"怀念那些有空鼓捣的日子","text":"上一次不分昼夜爆肝了七天国庆假期的经历还是在2013年，那时候没有疫情，那时候我参加工作刚满两年，那时候我还年轻。","link":"/2022/02/%E6%80%80%E5%BF%B5%E9%82%A3%E4%BA%9B%E6%9C%89%E7%A9%BA%E9%BC%93%E6%8D%A3%E7%9A%84%E6%97%A5%E5%AD%90/"},{"title":"123","text":"原文 很多时候，犹豫会消磨掉我们的意志和想法。记得许多年前又一次逛估衣街，我对于各种商家出售的货品并没有多大兴趣，反而在看到那些古旧的木质匾额和明显滞后于这个时代风格的建筑时，我被深深地吸引住了。仿佛从一个片段就能会放出当年繁华的街市一般，一种探索的感觉隐隐升起。那时，我还小。 在前几天，偶然见到一些藏在闹市之间的格格不入的院落，我觉得是时候要做一些事情，去勾画我的想象了。记录的目的地选定在重庆道，作为五大道之一，自然有不少名人故居、历史建筑什么的坐落于此，不过这些都不在我的记录范围。我要探寻的是那些第一眼就能触动我的，而标准我一时还想不好，反正像“某王府”那种人工修饰痕迹很重的地方，我是没多大兴趣的，反而是与时代或说与光鲜的表面反差很大的才是我关注的。至于水平高低，只能说新手上路、初学乍练。一没经验、二没装备，只能慢慢摸索，希望以后我会做得更好。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日 时隔多年，文中提到的那些事依然没有去做，但依然有想法。已经忘了当初的起因，只记得后来每次看到伴随着自己成长的建筑拆除的时候，那种记录就是保存的想法就每一次出现。小时候住过的房子、瞎跑的胡同、步行几分钟就能到的小学、没有汽车的僻静马路、放学时骑车穿行的小区、大学的南大门，等等等等都慢慢不见了，只剩下脑子里的画面，却也只能日渐模糊。图像的文字的记录可能是一个普通人能够去保留和回忆那些过往最有效的方法了，每一次迟疑每一次明天都可能再一次丢掉一个现实存在的场景。 标题没有改，就是当时随手敲下的“123”，寓意着简单和开始，恰好符合文字想要表达的。重启小站、重启当年的那些个想法，希望这一次会更好。","link":"/2012/12/cath.dnip.net/123/"},{"title":"doubanOAuth更新","text":"原文 源码：https://github.com/cath-gh/doubanOAuth 2013.01.26 终于调通了发图的部分，另外增加了ErrorCatched事件。 关于发图： 首先说给书记写笔记时，图片顺序无所谓，但是图片编号必须从1开始，且不间断 发日记中带图，pids参数传递图片编号，类型为List&lt;int&gt;，不要求起始数字，也不需要连续。layout、desc、imagePath要求其数量与pids一致。 已知问题： Shuo，block用户仍然不行，依然需要知情人的帮助 日记发图，不清楚为什么在日记内容末端会自动添加所包含的图片 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日","link":"/2013/01/cath.dnip.net/doubanOAuth%E6%9B%B4%E6%96%B0/"},{"title":"不要劝人向恶","text":"原文 在看过死亡实验之后，一种很压抑的感觉持续了几十分钟。不同于夜晚回想恐怖片情节，也不同于影院大屏幕影音的震撼，而是一种完全的心理上的影响。在现在这样的花花世界里，一部影片在播放完究竟保有多久的记忆呢，在我不算多的观影记忆中，关掉播放器的那一刻差不多也就告别了影片相关的一切，即便是优秀的片子也只是作为茶余谈资而已，而这一会迟迟走不出电影情节的感觉还是头一次。 在豆瓣上，我给死亡实验打了5星得评价，其实从很多方面来说这个片子都有一些缺憾，比如没有很好的开始、结局的处理也比较仓促、也没有在情感上做过分的渲染，不过这些技术因素在一个绝好的选材面前都不再重要。在当惯了中立观影人时，突然遇到一部直至内心的影片，强烈的共鸣感打动了我。看了看豆瓣上的影评，知道影片以一个真实的“监狱实验”为背景，情节也基本一致，虽然伤亡情况更为突出，不过考虑到影片中实验者为成年人不同于真是实验的大学生，情节并不突兀。影片更多的作为一种记述，实验本身所要研究的简单来说就是环境对人性格的影响，进而有人延伸到当权利不受限制时出现的情况。我想说的是，人性本如何，本恶。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日","link":"/2012/12/cath.dnip.net/%E4%B8%8D%E8%A6%81%E5%8A%9D%E4%BA%BA%E5%90%91%E6%81%B6/"},{"title":"免费建立一个自己的小站有多难","text":"原文 当我费了九牛二虎之力终于能开始写下现在的文字时，我觉得要实现这个目标真的没有随口说说的那么简单。对于一个突发奇想要自助建站而又没有任何经验的人来说，面对的问题是根本不知道从何下手，简单描述下我的建站经历吧。 首先要确定目的。如果你只是想写写博客，那没必要走下面的好多条弯路。可以直接使用现成的免费博客，像大众化的新浪博客、偏技术类的cnblogs、甚至QQ空间也都是不错的选择。其实这也是我最初的想法，找个空间记录一些东西，不过事实证明我对于写东西的兴趣远没有我想的那么强烈。很快我就走偏了，找到一个自己能控制的空间成为了当前目标。我走的第一个弯路是新浪的SAE， 在我注册时SAE还不像现在有那么多限制和收费，品牌效应和提供的服务让我感觉终于找到组织了。也是在这里，我才第一次安装了typecho，很奇怪为什么不是wordpress。能在可控的空间自由的选择程序安装对于从类似QQ空间走过来的我，当时真的非常兴奋，暗下决心从此开始玩博客了的念头也是有过的。当然在激动之余，考虑了下云豆的费用，觉得为了三天打鱼两天晒网的花钱实在不值，于是果断放弃，进而开始下面更为艰难的寻找过程。 为什么会艰难，即使是找个免费空间也是百度一搜一大片，所以我也很纳闷我是不是走错了路。我的目标是免费的域名和空间，不要求顶级域名，只要能访问、速度上说的过去就行。第一个选定的是Free Web Hosting Area，这算是一个相当不错的免费空间供应商了，也提供比较好的域名后缀，我当然不喜欢那种数字字母组合的密码式后缀，唯一的限制是30天至少一次的点击，可以说很适合个人建站。本来用得好好的，我也在上面试验了wp、joomla，不过后来ftp就变得非常不好用了，几乎是不停的掉线，到后来干脆连个人域名都访问不了。难道被墙了？不可能啊，我什么还都没写呢，不过发现还是可以通过代理访问的，估计是eighting big期间又墙了一批地址，我的小站也不幸中枪了，只好放弃。 偶然的机会看到一篇文章WordPress建站指南，按图索骥找到kilu.de。又发现一个相当不错的空间，只是在注册上遇到一点困难，网站限制了中国ip，通过代理搞定。注册域名、安装wp都很顺利，导致我再次更换的原因出现在一个wp插件的安装上。Google Analyticator提示“Google PHP API Client requires the CURL PHP extension”，这种问题我显然搞不定，上论坛一看管理员对于类似问题的回复就是压根就别想，免费空间不要提CURL。其实我压根就不信管理员的鬼话，因为我提到的第一个空间就支持。终于找到现在的空间提供商You Hosting，因为网上找到的这个空间的注册教程都是在它改版前的，所以这里重点说一下不同的地方。 You Hosting是不提供域名的，虽然说可以免费获得Reseller Club的账户，但是买域名还是要花钱的，所以考虑选择另外注册域名跳转到该控件。找到DNIP.NET，注册好二级域名备用，跳转ip一会再设置。在You Hosting进行配置，在Configuration-&gt;Master Domains中添加域名。在这里我着实困惑了一段时间，我一直以为是要加入我注册的二级域名的地址，结果提示无效，试着添加.tk的域名则提示不支持.tk，看来是特意做了限制。最后想到也许先加入一级域名，再添加子域名可行。 在Control里面添加自己注册的子域名，然后复制Account Information中的ip地址，在dnip.net直接选择update，输入好ip更新即可。更新后需要等待一段时间，我试过几次大概在两三分钟就可以成功跳转。 至此，一个完全免费的个人小站就算初步搭建完成了，至于安装什么程序就看个人喜好了。友情提示，免费的东西不要提什么时效了，能玩一阵也是好的，我也听到过说You Hosting会删用户数据的传闻，所以还是要做好数据备份啊。希望本文能帮助到有需要的人。 备注 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月20日","link":"/2012/12/cath.dnip.net/%E5%85%8D%E8%B4%B9%E5%BB%BA%E7%AB%8B%E4%B8%80%E4%B8%AA%E8%87%AA%E5%B7%B1%E7%9A%84%E5%B0%8F%E7%AB%99%E6%9C%89%E5%A4%9A%E9%9A%BE/"},{"title":"对于豆瓣API的一些看法","text":"原文 第一次接触到豆瓣API应该是在它的小组，当时还是V1版本，提供的函数也很有限。原本我想要做一个功能上类似豆瓣的本地程序，其实即便在当年来看winform也不再是趋势了。我的初衷是，豆瓣对于图书、音乐的条目是以实际发行版本作区分的，这就会导致明明是一个作品却拥有多个条目。比如说台湾地区的音乐专辑，很可能会区分出一个大陆版来，而即便不区分，也会有各种各样的白天、黑夜、微笑、哭泣版本出现。如果说不同的版本确实有一两首歌的不同，确实需要区分对待，音乐勉强可以接受，不过图书就没那么多迫切的需要了。不同的出版社、不同的年份，我看的都是三国演义，我想记录的是我看了这本书，而不在乎其他信息。当然在译本书籍上区分还是必要的，毕竟译者的不同往往决定着文字的质量，这个可以借助额外的描述，书的名字仍旧只采用一个。 我当时的想法就是做一个条目更清晰豆瓣版本，应该是百度链接到了豆瓣API小组，也第一次接触到了OAuth。想做和做出来毕竟是两回事，可以说基本上不会写代码的我还专门百度知道问了下什么适合做这种应用，也是因为那个回答让我走上了学习C#的路。因为能力准备不够，所以很快就放弃了。第一次尝试失败了，但是我提了一个问题，现在看来这么多年过去了，豆瓣还真是没啥变化。豆瓣的APP除了一个fm，其他的那个也没触碰到豆瓣发家的核心部分——三大门类的收藏和评论。什么态度？其实也就是不太支持网友们自己瞎搞。 直接跨接到现在的V2版本，提供的方法更少了，权限限制更严重了。豆瓣最初的想法可能是放出一些借口，看看网友们能不能做出点新鲜的东西，但是自己核心的东西又舍不得放，即使是周边功能也是有这个没那个。就那么几个干巴巴的借口，豆瓣以为网友都是数据挖掘的大神啊，看看豆瓣API小组几天不翻页的帖子和各种没人回答的问题，你还在奢求什么呢？ 我第二次关注豆瓣API时，OAuth版本已经变成了V2。看了看文档，认证上更方便了，返回json格式文本也方便解析，难道晴天来了，那就再来过吧。我真的没想到重蹈覆辙竟然这么的容易，如果说豆瓣API的文档中看不中用，那么看看新浪微博的文档，就觉得这样的评价也高抬了。返回的json字段和你描述的不一样不要紧，我直接人工看一遍也ok；V1到V2部分类共存也不要紧，我多写几个也能对付；返回字段时有时无也不要紧，用了Newtonsoft.Json后一切搞定；你返回的photo字段格式变态也不要紧，我用dynamic(实际用object即可)加正则一样搞定。可是在我克服了重重困难之后，迎接我的却是各种莫名其妙的情况。更新日记不返回json对象，而是一堆\\之后的字符串；部分搜索类方法不加token跑的通，加了就不行；返回的count、total不准确；最离谱的就是个别方法一直不正常工作。我所能想到的就是，豆瓣官方对于这个项目是没有多少支持的，甚至是不支持的也未可知。 前面有一段忘了说，就是在第二次尝试时，我起初用的是正则表达式的法子，后来觉得太麻烦(豆瓣三大类页面代码极大的不同)，才考虑使用API的。现在看来API+正则似乎是比较完美的方案，正则不怕别的，就怕突然改版，不过只要不是大面积的应该都能应付。 最后说点闲话吧，用豆瓣这些年有过一个想法。豆瓣不是搞技术的地方；豆瓣人文气息不浓，小资、假文艺、装的都不少；豆瓣不搞文化，自然没有也出不了大家；阿尔法城是豆瓣的败笔，从测试开始我就是这么看的；九点是个好地方，应该融合到主站里面，在丰富一下内容就更好了；豆瓣FM本来很好的，现在广告太多了，也推出了收费的版本，呵呵。 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日 豆瓣API似乎真的已经荒废了，可能是没能发现和带来真正有价值的产品，无论是豆瓣自己还是寄希望于外界开发者。豆瓣最有价值的数据却没有得到更进一步的挖掘与展示，这是可惜的；豆瓣沦为水军、软文的战场之一，这是可悲的；豆瓣在炒作元宇宙概念之前很多年就砍掉了自己的阿尔法城，这是可叹的。 我喜欢豆瓣，在当年看到回顾阿北在豆瓣胡同的咖啡馆敲出了豆瓣网站的文章时，更是沉浸于那种既文艺又生活的感觉。后来小众网站走红了、林子也大了、商业化的压迫又难以避免，反应滞后、方向摇摆、东施效颦这些文字用来描述豆瓣这些年的决定丝毫不过分。 我喜欢豆瓣，我希望它还能好起来，在商业化的时代完成利益与梦想的调和。","link":"/2013/01/cath.dnip.net/%E5%AF%B9%E4%BA%8E%E8%B1%86%E7%93%A3API%E7%9A%84%E4%B8%80%E4%BA%9B%E7%9C%8B%E6%B3%95/"},{"title":"梦魇","text":"原文 当我又一次从梦中紧张的醒来，回忆着梦中情景的一幕一幕时，我觉得有必要把它记录下来。首先要说明回忆梦中故事并不是件很容易的事，随着你不断的回想，同时也在渐渐忘记。我很奇怪这种有悖于一般现实场景的体验，就好比你背单词都是越想就记得越牢，唯独梦会难以抓住般的溜走。 虽然标题叫梦魇，但是并没有什么恐怖片中的情景，而是一种隐隐的紧张感，有时是压抑感。隐隐伴随，却寸步不离，直到并不突然的慢慢醒来，想来梦中情景仍旧心悸不已，知道辨明现实才如释重负。 再读旧文 以上内容为旧文搬运 日期：2022年2月20日 梦境有一个很有意思的地方，梦中的恐惧、紧张、喜悦、美好的那种感知程度都远大于现实世界。在醒来之后回想梦境，想要再次体会那种感受的时候却怎么也找不回来当时的感觉，就像握不住的沙，流失只在指缝。 在抖音上看到过一个多巴胺影响人体感受的视频，深以为然。人体所谓的感官都可以归结为或化学信号或物理信号传递给大脑（这里的专业知识我可能描述有误），就像模数转换一样，把一个模拟的感官反应转化为数字的信号量。最终以这种信号携带的信息给出我们对外来影响的反馈。 所以在梦中，你的恐惧是恐惧的信号、你的开心是开心的信号，程度直接关联于信号的强弱。而在你醒来之后，想要复现这种信号病达到那种强度就变得及其困难。","link":"/2012/12/cath.dnip.net/%E6%A2%A6%E9%AD%87/"},{"title":"豆瓣SDK doubanOAuth","text":"原文 基于豆瓣API V2提供的接口，使用C#做了下简单的封装。实现了全部已知的方法，大部分已调通，个别实现还存在一些问题。 各种传图的方法，image参数无效，后续版本待修改 Mail，发豆邮频率过大导致需要输入验证码部分未实现 Shuo，block用户不可用（希望有了解block参数设置的同学帮忙） Note，更新日记返回json字符串而不是对象，暂时未处理 本代码需要.Net4.0的支持，最初是为了应用dynamic解决photos的字段命名问题，后来发现用object可以代替，不过可选参数确实需要4.0的支持。 关于更新：我当然希望把这个sdk做好，只是在这个过程中感到豆瓣提供的信息很少，困难很多。考虑到V1的api即将停用，估计V2版本会有较大程度的更新，我也会适时的跟进 关于代码： 所有的方法的是static的，调用比较方便，对于有洁癖的同学或许有点不适，我也在想改进的办法 HttpWebRequest的构造中，referer用了我自己小站的地址，不喜欢的可以修改代码 提供了Common.LastError 以查阅最新的错误信息，按说应该提供事件支持的，我还没想好是采用事件还是Exception的方式，以后会完善 方法名前缀缩写说明 User Usr Authentic Auth Book Bk Music Mus Movie Mov Collection Col Annotation Anno Event Evt Discussion Disc Online Onl Photo Pho Comment Comm 关于文档：我不善于写文档，却对文档有着精品情节。对于现在这样一个姑且称之为半成品的东西，文档暂时没有，好在代码里注释还算丰富，也尽量做到了自解释命名 源码：https://github.com/cath-gh/doubanOAuth 再读旧文 以上内容为旧文搬运，文中链接、图片、方法均已不可考，仅做个人记录 日期：2022年2月26日","link":"/2013/01/cath.dnip.net/%E8%B1%86%E7%93%A3SDK%20doubanOauth/"},{"title":"旬回豆瓣","text":"回归豆瓣 其实从来也没有类开过豆瓣，从最初注册的2008年算起恰好一旬，当我想要开始写文字的时候最先想到的，还是豆瓣。对这里的感情一直在变化，出于记录个人读书观影听音乐点滴的目的，我非常幸运和感谢有这么一个持续十余年运营的地方。豆瓣几经改版，产品线也有过很多尝试，对阿尔法城的期待和最后下线时的怀念，对豆瓣api的希望、自己写出了C#版本的接口却不得不面对没有官方人员再去维护的api的事实，对豆瓣评论字体太小、排版丑陋而又十几年如一日坚持不变的吐槽。然而，在我选择一个写东西的平台时，看过了世界最终还是回到豆瓣，不变的是豆瓣一直是我一个希望的寄托，我一直希望豆瓣会更好。 为什么要开始写字呢？如果在夜晚脑袋中思路高速运转的时候，有一台记录仪可以直接转换成文字，我是不会在白天边会议思绪边在这里敲字的。即便在我不多的生活经历中依然有过数次对于人生、对于社会、对于哲学的思考，当我们走过这一生能留下的是什么，在回首往事时能想起什么。文字和照片一样，这就是我们来过的印记。 我不是一个爱写日记的人。初中时老师要求写周记一度让我很痛苦，本就不擅写做的我又想不到什么可记录的事情自然无法下笔。后来到了大学，莫名的渐渐喜欢上了记录情绪，也许几天也许几个月，慢慢的也写满了整个本子。行文还是那么没长进，却不妨碍我乐在其中，独自在自习室、在书桌前、在橙黄的灯光下写着见闻感触、理解与思考的感觉，如同涓涓细流绵延而顺滑。 看奇葩说有感 最近和媳妇一起在看奇葩说第六季，几乎每一道辩题我俩选择的方向都不一致，我们为啥要看一档可能导致家庭不和睦的综艺啊，所以我非常平和而郑重的表达了自己的看法。 要怎样才能说服别人呢，在我看来有两个方法，核心都是以高打低。一种情形是领导安排工作，就算下属不以为然大多也会依令执行，君君臣臣父父子子就是这一类；另一种是高屋建瓴降维打击，黄执中管用的开头“这道题说的是…么，不是”，然后从另一个层次去论述，这是一个行之有效难以辩驳的思路。假若双方在同一量级、说的内容也在同一框架，往往各执一词、无法达成统一的结果。网上传过的一短话就是，不要和xx争论，他会把你拉到他的水平，然后用丰富的经验打败你。这就是讲道理才有机会说服双方，不讲理要么没有终点要么劣币驱逐良币，最终以“高尚者”的妥协收尾。“高尚是高尚者的墓志铭/卑鄙是卑鄙者的通行证”便是最好的总结。 第一，辩题不是问题。这是将不同观点的争论限制在一个盒子中的前提，综艺节目也好、专业辩论比赛也好，辩题终归是认为设置的比赛，它不是生活中真实的问题、不是非黑即白的是非问题。第二，要接受每一道辩题都是可辩的。选手们的持方是抽签的，无论本人怎么想也要绞尽脑汁准备持方的发言材料。好的辩手是在正反方都能发挥的，我们没有那么高的水平，但至少要认可这个公共基础，一道辩题的双方都是可以找到出发点去说服观众，而不是一个在时政节目讨论的社会热点，要找出一个可行的方案。 看奇葩说时我们在看什么。比赛进行到半决赛决赛，选手们频频为对手鼓掌，这也是这个节目的意义。独立思考的态度、语言表达的技巧、观点角度的挖掘、不同思路的包容，这才是思辨的乐趣。马东说过奇葩说不是一个寻求真理的节目，这是一个很好的指引，不正确的看待节目传达的目的和将节目与现实混为一谈一样危险。 奇葩说第六季结束了，陈铭之后我最喜欢的辩手詹青云不出意外的获得了bbking，理性而有趣、恰到好处的语气和节奏、内容的充实和角度的精确，两位辩手具备相似的特质，胜出的理所当然。有千人千面的哈姆雷特，同样也有千人千面的奇葩说，以上便是我看到的。 版权归作者所有，任何形式转载请联系作者。 作者：Cath（来自豆瓣） 来源：https://www.douban.com/note/749706785/","link":"/2020/01/%E8%B1%86%E7%93%A3%E6%97%A5%E8%AE%B0/%E6%97%AC%E5%9B%9E%E8%B1%86%E7%93%A3/"}],"tags":[{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"建站","slug":"建站","link":"/tags/%E5%BB%BA%E7%AB%99/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"记录","slug":"记录","link":"/tags/%E8%AE%B0%E5%BD%95/"},{"name":"cath.dnip.net","slug":"cath-dnip-net","link":"/tags/cath-dnip-net/"},{"name":"豆瓣","slug":"豆瓣","link":"/tags/%E8%B1%86%E7%93%A3/"},{"name":"C#","slug":"C","link":"/tags/C/"},{"name":"doubanOAuth","slug":"doubanOAuth","link":"/tags/doubanOAuth/"},{"name":"豆瓣日记","slug":"豆瓣日记","link":"/tags/%E8%B1%86%E7%93%A3%E6%97%A5%E8%AE%B0/"},{"name":"奇葩说","slug":"奇葩说","link":"/tags/%E5%A5%87%E8%91%A9%E8%AF%B4/"}],"categories":[{"name":"文档","slug":"文档","link":"/categories/%E6%96%87%E6%A1%A3/"},{"name":"随笔","slug":"随笔","link":"/categories/%E9%9A%8F%E7%AC%94/"},{"name":"旧文","slug":"旧文","link":"/categories/%E6%97%A7%E6%96%87/"},{"name":"记录","slug":"记录","link":"/categories/%E8%AE%B0%E5%BD%95/"},{"name":"观点","slug":"观点","link":"/categories/%E8%A7%82%E7%82%B9/"},{"name":"代码","slug":"代码","link":"/categories/%E4%BB%A3%E7%A0%81/"},{"name":"电影","slug":"电影","link":"/categories/%E7%94%B5%E5%BD%B1/"}]}